{
    "corpus": [
        {
            "label2": {
                "Color": "positive", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "neutral"
            }, 
            "data": "This top is stunning. the colors are vivid and it is extremely cozy and soft. however it seems delicate and would need to only be worn once in a while. it is not an everyday top. the material has a cotton candy like appearance. it really is unique and one of a kind.", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "negative"
            }, 
            "data": "Even following the care label exactly, it shrunk ~3 inches in the length and overall in the diameter. i had to return this since i am tall and it looked more like a work-inappropriate mini after the first wash.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "neutral"
            }, 
            "data": "I was excited to receive this top. it looked great online, vibrant colors with the beautiful detail on the sleeves. when i tried it on, the fabric looked and felt cheap. it is not a flowy top. do not recommend it.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "neutral"
            }, 
            "data": "Nice weight sweater that allows one to wear leggings or ultra skinny jeans without looking like i'm pregnant (not that there's anything wrong with that) very feminine and light weight enough to wear with a cami underneath and a pretty scarf.", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "neutral"
            }, 
            "data": "Perfect trans top. skinnies or boyfriend and booties. love the mixed prints", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "neutral"
            }, 
            "data": "Pretty pink top is great for layering iand alone in the summer and spring", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "neutral"
            }, 
            "data": "Didn't like at all. itchy fabric, looked good on model but not on busty girl.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "negative"
            }, 
            "data": "I love this dress, i mean it is really pretty in person, however, the breast area is just too small... i can't wear a bra with it, and my \"older\" breasts just droop, not flattering. they are barely covered... i am a bit disappointed at that, but if you are smaller up there, i say give it a try... i am 115 lbs, 26.5 ion waist, 30dd and xs petite was great everywhere but chest.\n \n colors and fabric are great, i love that the different colors are different types of fabric... too bad.", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "I loved this skirt on but just the other reviewers, it runs small in the waist throwing off the dimension of the skirt. i ended up getting the 0 despite the fact that it was tighter in the waist because the 2 at this length (with my height) and amount of material became overwhelming on me. it would have looked better in a slightly shorter cut as another reviewer stated as well.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "positive"
            }, 
            "data": "I like this sleeveless sweater - it adds warmth and visual interest without adding a lot of bulk. paired with black/white patterns it's pretty versatile (as seen in the pics) - a great staple for a more casual office environment. being a taller girl i love the length on it, and find it's flattering for my curvy figure.", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "neutral"
            }, 
            "data": "I've been buying stevie ankles for years from retailer and been very happy. the past two pairs i bought had a heavy chemical smell, which i imagine is some kind of starch/chemical to keep the denim stiff. with the first pair, after enough washes to get rid of the bad smell (4), they lost all form and looked terrible since they were washed i couldn't return them. the 2nd pair arrived with the same heavy smell and i returned them. it may be they are made elsewhere now, but it's disappointing.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "This sweater is a cute design but did not work for me. i am 5'9\" and this is way to short/cropped and looks awkward. the quality was so so, it looked stretched out in the front. it's getting returned.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "positive"
            }, 
            "data": "I received this shirt in my typical xs and it fits perfectly. i?m not crazy in love with it but i also don?t dislike. the shirt is on the thin side. do i need to wear a cami underneath it, no. my concern is holes. it does remind me of a material that could develop some holes after some wear and washes. with that being said i?ll wash this shirt in cold water and hang dry and hopefully that will prevent holes from developing. the length is fine and i do like the slits in front?it adds a little dim", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "neutral"
            }, 
            "data": "Wanted to love this colorful romper. the fabric was suuuuper thin and very cheap feeling and looking. no way would i wear this.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "neutral"
            }, 
            "data": "This is a pretty top that is conservative enough for the office, with a modest neckline. there is a little hidden snap or button under the bow at the neck so you don't have to keep fussing with the tie the fit is loose in the waist and high at the neck, so the sheer parts are the only thing to give it a little flirtiness. there is a matching camisole underneath that snaps in at the shoulders. overall, i thought it was nice when i tried it at the store, but it didn't have enough extra \"wow\" to ge", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "It's short and wide. not a good combo for anyone who isn't stick thin.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "I ordered this sweater in black and thought it was a pretty design and something different in a cardigan. when i tried it on, it was an odd fit and very boxy and unflattering. i wanted to like it and keep it, but i knew i would not wear it so, unfortunately, it went back.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "positive", 
                "Cost": "positive", 
                "Fabric": "positive", 
                "Fit": "neutral"
            }, 
            "data": "Pretty and unique. great with jeans or i have worn it to work with slacks and heels. the colors, print, and embroidery are lovely. reasonably priced!", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "Really wanted to lovethis top but it ran small in arm length & in the front, bottom...backside was perfect coverage...also most important this top is see-through! item as pictured is not accurate!", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "positive"
            }, 
            "data": "This dress is stunning- vibrant colors and flirty feel to it. i got the small and i am a 34b/27 pants, 132 lbs- great fit. i only question two things- am i tall enough to pull off the extra fabric in the back and what the heck do you where for a bra? those two considerations are why i didn't give it 5 stars.", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "neutral"
            }, 
            "data": "I ordered size small and medium because i can go either way depending on brands. and both look great! there is no significant difference except medium fell about 1 inch longer. i am 5'4\" and size small hem fell about 1\" above knee. size medium felt tab bit more loose but i thought fabric may stretch a bit after wear so i'm keeping size small. what a beautiful dress! although the body of dress is jersey material, it is lined so there is good coverage. i tend to not like \"faux leather\" since they", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "This was not what i was expecting at all. i am a medium in just about everything but ordered a large to possibly wear this as a dress instead of a tunic since i am around 5' 4\". the large fit like a small on me, and not like a typical oversized sweater type small, but a normal fitted top small. a previous reviewer said it is long and straight, and i think that is a good description for it. i think the models wearing this in the pictures are all wearing an extra-large or a different cut of the", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "I am reasonably petite, but i like sweaters very oversized and large, so i ordered this sweater in a large. i was very disappointed when the sweater came because while the sleeves and upper chest area were in large, the length of the sweater did not at all increase when the size did. because the lower part of the sweater did not increase in size, the sweater ended up looking very awkward, with the chest and sleeves very large and long but then a very tight and short (waist-length) stomach. i do", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "negative"
            }, 
            "data": "Nice fabric, great color, would be lovely ... on someone with a straight-and-narrow body type. for ladies with curves, take a pass--too much like maternity wear, and not in that elegantly slouchy kind of way. the straight-up \"is she or isn't she\" kind of way.", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "neutral"
            }, 
            "data": "I walked into retailer with low hopes of finding a dress for a friend's spring wedding, as a lot of this season's dresses are more casual, but was drawn to this pretty number for multiple reasons: it can certainly be dressed up or down depending upon accessories, the fabric feels incredible, it has pockets, and it's really fun yet classy as heck. typically i wear a 10/m in dresses, but they only had a 12 in store, so i took it and made it work by tightening the sash a bit extra and wearing a bra w", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "neutral"
            }, 
            "data": "Beautiful sweater but the material is a bit thinner than i was expecting. but it hangs nicely and the sleeves are nice and long!", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "Lovely knit and so soft, but the bottom curls up underneath, similar to the bell sleeves. runs oversize too, got xs and it's too bulky and unflattering since the bottom doesn't lay flat. returned!", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "neutral"
            }, 
            "data": "This is a cute top with jeans for spring and summer, or warmer climates - very fresh and airy. the fabric hangs nicely and although it is lightweight, it is not too thin or see through. it does not get overly wrinkled either. the style is flattering for most body types and it can be dressed up or down. the v neck is just right: not too deep that you feel like you are showing too much cleavage, but deep enough to be feminine and slimming. i normally wear a size s in retailer tops and blouses", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "positive"
            }, 
            "data": "I am a curvy woman and leggings are new to my world. i am sorry that i did not discover these leggings sooner because they are lovely. they are comfortable and cozy with a great fit. i am 150 lbs and 5'7 and the m/l fit perfectly. i have the black and plum colors. great purchase!", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "negative"
            }, 
            "data": "I sized up based on other reviews which was good advice. i am typically a size 6 but sized up to a 10. the pants are very unique and i think on the right body type would look amazing. it seems like someone with curves and a small waist might fit these splendidly...but that's not me. i had some extra material puffing about in the zipper region. i also expected the material to be thicker but found it to be more silky.", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "I ordered these in my usual pilcro petite size 6. they were impossible to button, which is interesting 'cause i also ordered the pilcro wide leg chinos in the same size and they fit perfectly, as usual. but it ended up being ok because i don't care for the speckled, slightly rough material or the contrasting piping. back they go!", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "negative"
            }, 
            "data": "This is a beautiful tunic. i wanted it to work so much but i couldn't get past the itch factor. also, the sleeves were shorter than i expected. when i wore a light tee underneath, it didn't move well and looked bulky so sadly it went back to the store. if the material doesn't bother you, buy this. would look great w/ tights/leggings and boots.", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "neutral"
            }, 
            "data": "I got to try this on today and i really like it. the fabric is a normal t-shirt kind of fabric (i was hoping it would have been kind of special) and the v-neck in the front does go down a ways so that some cleavage is showing. i would feel comfortable wearing it as-is outside of work, but would have to pair it with a cami if i would going to wear it to work. normally, i am not a huge fan of v-neck in the back and it drives me crazy thanks cami's these days are often made with a \"versatile\" v and", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "neutral"
            }, 
            "data": "Matronly and unflattering. i think this may work on a very tall and slender body type.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "negative"
            }, 
            "data": "I can understand the concerns of another reviewer about shrinkage. i have a few retailer tops made of similar fabric and they have shrunk a bit. this too fits very well, but once i wash it, it will likely get a bit smaller. i ordered a small, but plan to size up to a medium. for ref. 32ddd bust, and the small fit perfectly with a camo underneath...the shoulders seem to be cut small. so if you are busty like me, size up.", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "negative"
            }, 
            "data": "I saw this top on sale and tried it on right away. my normal medium was too big, so i purchased the small in the rose color. wore it with a shimmery kimono and cream colored pilcro boyfriend jeans. wow, what an outfit!!!!\n then i washed it according to directions, and sadly it shrunk into a crop peplum tank. i was so disappointed. i wished i had read the reviews beforehand.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "neutral"
            }, 
            "data": "I just purchased this tank in white and blue. i find it to be soft and will be perfect for hot days but also can wear into the fall with a cardigan. it's super comfy but i do find at retailer that it's best to try things on in the store (it's hard to find perfect sizes online since things are cut so differently based on the designer). i got a large and though it's a bit flowy in the tummy area, it fits nicely across my chest (not tight).", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "neutral"
            }, 
            "data": "Nice tee, true red,3/4 sleeves, lacing is a nice touch. good quality and great sale price.", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "positive"
            }, 
            "data": "I love this sweater! pros: great shape (it's supposed to be a little oversized looking), great color (i have the ivory and it's beautiful), and fits well (the sweater looks boxy until you put it on and it flows in all the right places). the sweater is not soft. that is my only con. it looks so soft in the photos, but the sweater i received is not at all soft and cozy. it is warm. it will be great for the winter - great pair with leggings, skirts or just jeans.", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "neutral"
            }, 
            "data": "Three strikes and retailer is out for me! i am so disappointed. i really liked this dress and was looking for a fun, distinctive new shift dress. got it, tried it on, took it off, went back to look at the listing online...nowhere does it mention that it has a drop-seam in the shoulders. i guess you can see it if you zoom in closely on the image, but it's not mentioned in the text. who on god's green earth actually looks good with a drop-shoulder?! it hits every woman under 5'10\" right in the middl", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "Just tried 'layered sadie top' and it felt so nice on. good hand feel for both materials but note that the knit on top is a little too delicate for machine wash but can be hand washed. this item is definitely \"vanity-sized\". i'm 5'1, 113lbs and the xs looked nothing like how it does on the model. it was flowy as depicted but it came down much lower on me and looked a little maternity-esque. highly recommend because it's gorgeous and well made but i would definitely come in and try it out for you", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "positive"
            }, 
            "data": "This is my new favorite top! looks and fits as described.", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "neutral"
            }, 
            "data": "Another great dress by retailer. i've worn it with tall boots with heels, riding boots and booties...all look really good. i've also added a cream/beige cardigan and even a fuzzy/furry vest. very versatile. the only few things that i would have liked even more is that design of the dress be actual stitching and not just a flat print and also the material does shrink a tat when you wash it. it's a staple and keeper.", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "neutral"
            }, 
            "data": "I've purchased pilcro jeans in the past and they've held up great. unfortunately, the material used for this particular jean is a far, far cry from what it used to be. the thighs of these jeans start pilling (yes pilling!) after just a few wears. i've never had jeans do this -- whatever denim blend they are using is a complete disaster.\n \n don't buy these -- you will be very disappointed.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "Love the color, but the fit is just odd and frumpy. the sleeves are shorter than the should be. when i lift my arms, the entire sweater gets lifted. going back.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "neutral"
            }, 
            "data": "I wanted to love this sweater. the photo of the model makes it look so soft and warm. i liked the heavy texture and the extra long sleeves. however, after receiving this sweater i tried it on for less than 1 minute. one look in the mirror was enough to make me take it off and return it asap. the knit quickly expanding from small to large right over the bust, combined with the boxy shape was an atrocious combo. it must have added 30lbs to my physique and made my bust look matronly. yikes! this ma", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "neutral"
            }, 
            "data": "The cut is brilliant-the wash is subtle-the weight of the denim is sturdy but not stuff-and the stretch is just right. love it. the perfect staple. a scarf in the fall and rolled sleeves in the spring.", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "Per other reviewers, i sized up from a small to a medium and the jacket fits me just right with room for layers. it is short (cropped), but i like where it hits me and is versatile for jeans and dresses.", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "negative"
            }, 
            "data": "This top is super cute, however the bottom hem is all frayed....couldn't really tell that from the pictures. the \"flutter\" sleeves are too big...looks funny with the fraying...runs a little large as well. loved the color! perfect with white denim!", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "I ordered size large and find it too boxy and long. love the hem, although the top is too long in this size so it's a bit hard to judge how it'll look in the right size. the sleeves are cute and different, a bit wide and flowing. be warned, it's sheer which is more apparent from the side view. i could clearly see the garment cleaning instruction tag through the bottom side hem. has potential but not enough for me to reorder in a smaller size.", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "negative"
            }, 
            "data": "These pants looked worn, washed & old looking when i received them! the quality is super thin cotton as if it's been washed a million times & is about to fall apart! the workmanship is terrible. you can see loose stitching all over. the top portion is too tight & looks terrible stretched out. i liked absolutely nothing about this pants except the idea of them from the picture online...", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "I really wanted to love this dress. i bought it for a photoshoot that will be outdoors, and thought that the green color would be perfect. it is well made, but the fabric is lighter than expected. the biggest issues was the size. i am 5'7\" and typically a size ten. i ordered the ten and it fit like a 14-16. it was huge. if you order this, i would say size down two sizes.", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "negative"
            }, 
            "data": "First, the fabric is beautiful and lovely for spring and summer. i really wanted to like this top, but the fitting is so awkward for me. i typically where a 0/xs, and sized up in the shirt to a size 2. it was very tight and pulled funny across the chest (size 32/a). i also found the cut at the shoulders very narrow (need a strapless bra) and made it look unflattering overall. had to return this one back to the store.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "positive", 
                "Cost": "negative", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "My conscience screamed at me not to buy this sweater and i wish i had listened! i noted the fact that it was acrylic and also the fact that it was oversized. but i also loved the design and can't resist anything with mustard yellow. i was instantly disappointed when i received it, almost didn't even try it on. how can they possibly charge $185 for terrible itchy 80's acrylic? it looks cheap, it feels cheap and it didn't even fit well. only redeeming quality: easily returnable!", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "positive"
            }, 
            "data": "I read the first review on this and ordered both a small and a medium as i thought this would run small. i have to totally disagree with the reviewer! i find that this top runs true to size or even generous! the sky color is so pretty and this top can be dressed up with some nice heels and a necklace or it can be comfy casual! i usually wear a small in hh brand and this one was true to fit (5\"2\", broad shoulders, 120 lb)", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "positive"
            }, 
            "data": "Love this dress! just wore it last night to an early valentine's dinner. very classy, simple, but gorgeous. i'm a size 2 in just about everything but i always buy a size 4 in retailer dresses because i'm tall (5'9\") and have broad shoulders and a long torso, and sizing up in dresses works better all around. i am also not busty (32b). i did get this in a 4. this dress was a little awkward at first trying to hook and then zip but once i got that down it worked. the hook is right up under your", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "neutral"
            }, 
            "data": "I saw this online but it never struck me as something i would wear. however, after seeing it in the store it really caught my eye with its detailing, so i tried it on. what a great decision because it is so much more beautiful in person, and very soft and warm. it's a perfect winter sweater to start the new year. i am 5'-7\", 138 lbs. and the medium fit perfectly, though it's a little shorter on me than shown in the photos.", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "negative"
            }, 
            "data": "Love the fabric & lace on this top. like other reviews said the arm area is tight where the lace meets the fabric which makes the fit uncomfortable. sadly this top is going back. if you have very skinny upper arms this top will fit fine.", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "neutral"
            }, 
            "data": "After missing out on last year's similar dress, i am so glad i finally purchased this one! it is beautiful in person. i bought to wear to a wedding, but i am curious if others think it might be too white? i bought the peach color. i will keep this dress no matter what. hope they come out with more next season!", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "positive"
            }, 
            "data": "This dress is very pretty in person. it fits true to size and is very figure flattering. one other reviewer mentioned it is a bit low cut, but i think that can be resolved by wearing a cami underneath to cover cleavage. my only gripe with this dress is that it's a little rough and stiff feeling. i am really sensitive to that and only buy things that are velvety soft. it probably works for most people but not for me, so had to go back.", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "I love retailer and fell in love as soon as i saw this dress online. being 5'10\" i love a quality maxi dress and this one did not disappoint. however, being 5'10\" also means the top sweater overlay hits me way short. it looks ridiculous. i also thought that this was very heavy for a maxi dress and could not imagine wearing it in 80 degree weather. unfortunately after waiting so long for it's arrival this is going back.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "neutral"
            }, 
            "data": "I wanted to love this sweatshirt, but alas, it is going back. upon opening and unfolding, the first thing i noticed: the dots and not solid. they are sort of distressed looking, with parts of them missing. secondly, it doesn't have a lot of structure. it's soft and kind of floppy but in a weird way. it's just not flattering on me. it looks more like a pajama top than something i would wear out of the house. for reference, i ordered the 3, and i'm usually a 10/12 in tops.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "neutral"
            }, 
            "data": "In my retailer this was hung over in the pj section, and it really has more of a jammie top feel... soft, thin and stretchy. it's super cozy and comfortable and it drapes really nice. mine seems to have stretched out a little, especially the neckline (and the little buttons have a hard time staying closed). i'm happy with it though for what it is - a great, casual day t.", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "positive"
            }, 
            "data": "More and more i find myself reliant on the reviews written by savvy shoppers before me and for the most part, they are right on in their estimation of the product. in the case of this dress-if it had not been for the reveiws-i doubt i would have even tried this. the dress is beautifully made, lined and reminiscent of the old retailer quality. it is lined in the solid periwinkle-colored fabric that matches the outer fabric print. true to size and very form-fitting. falls just above the knee and does not rid", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "neutral"
            }, 
            "data": "I originally got these in a 29 petite and thought they fit great right out of the bag (i'm usually a 6/8).. and within an hour of wearing them (to retailer, actually), the knees had gotten so baggy that they looked absolutely ridiculous; i've never had jeans do this. the salesperson at retailer agreed that they seemed very odd. i exchanged for a 28p at her suggestion, and i just hate them. i'd say the smaller size seems every so slightly small, but nothing major - but the waist actually folds over a", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "negative", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "neutral"
            }, 
            "data": "For reference i am 5'5' 138 lbs with an hourglass figure and my usual small fit perfectly. the problems: 1. this skirt is not black but a charcoal gray/purple. 2. the sipper is reinforced with a stiff boarder on the inside so no matter where i put the waist it sticks straight out making me look like i have a tail under my skirt. in other words, i had a very pointy butt. also the slit or tulip part of the skirt goes all the way up to the waist, it needed to be tacked to the other part of the skir", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "negative", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "This sweater looked so promising with the tie waist and pretty lacy edging, but turned out to be a disappointment. it was much shorter than it looks in the photos and barely came to my hips. and the plum color was much darker than i expected, more of a dull brownish-burgundy.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "negative", 
                "Fabric": "neutral", 
                "Fit": "neutral"
            }, 
            "data": "This top is perfect for the first day at clown college if you want to see some clowns cry. the sleeves are probably the worst part of this overpriced monstrosity. the elastic at the cuffs makes the already comically large sleeves billow and puff out even more. \n \n buy this if you enjoy walking to the post office to return things.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "positive"
            }, 
            "data": "This top is so pretty and feminine. the different floral patterns work very well together and add an interesting flare to this unique blouse. the fit is very comfortable yet still very flattering due to the empire waist and flared sleeves. the fit is true to size, i usually wear a size medium or 10 in retailer tops and the size 10 fit quite nicely. this top is a great addition to any spring wardrobe and should transition nicely into summer as well.", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "negative"
            }, 
            "data": "Dang, i got a small and was still swimming in it. it's made of the fabric that increasingly seems to be the fabric of choice for all things t-shirty- soft and thin-ish, a bit translucent. i'd rather wait for something more formfitting and flattering- back it went.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "negative", 
                "Fabric": "neutral", 
                "Fit": "neutral"
            }, 
            "data": "It's really cute but seems expensive for the type of fabric. i thought it would be more substantial. got lots of compliments .", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "neutral"
            }, 
            "data": "I absolutely love this shirt! even though it has a large flowy design it looks wonderful. the print is so unique and will transition to autumn beautifully! i loved it so much i got both colors.", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "I love this top. i got it on sale and am so glad that i did. it is a short too but still super flattering. it isn't too boxy on me.", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "neutral"
            }, 
            "data": "This jumpsuit looked so great on the model, and looked so hideous on me. i'm 5'4\" and in great shape, and this jumpsuit looked absolutely ridiculous....not to mention it rode right up my backside in the worst possible way. i'm so disappointed!", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "positive"
            }, 
            "data": "I bought this in both the taupe and ivory. the beading on the neck line, the tie at the neck and the pleats make this a fun shirt. i bought a size 2 which is normally what i wear at retailer, so i would say it is true to size. i really like the length of the top. it hits mid-hip on me. it is a tad shorter on the sides than i would like but it is still long enough to cover my waistline. i also think the arms are too long so there is kind of a balloon look at my wrists because of it. i bought it to", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "positive"
            }, 
            "data": "I love the shirt and it runs true to size everywhere but the arm holes. i bought a size small and the length was great, the fit was great, but the arm holes were gappy and big. i had to return it and was bummed because i loved it otherwise.", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "I ordered these pants in black and brick. the pattern is great, but the sizing and fit are way off. i usually wear an 8 or a medium in retailer. i ordered these pants in a 10, 12, and 12 petite. the 10 actually fit, but there is no stretch in these fitted pants. they were very uncomfortable to walk or sit in. however, if you're standing up all day and not doing much moving around, these pants are perfect! the print is great in both black and brick. i couldn't decide which one i liked best. wish th", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "After seeing this on anthto's facebook page i was so excited to order. i ended up going to a store and trying on. i couldn't believe it was the same shirts when i first saw it. i thought this ran quite big. and the shape was odd. lots of material in the middle. i am a mom of 3 young kids and didn't want people to think #4 was on the way.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "positive", 
                "Fabric": "neutral", 
                "Fit": "neutral"
            }, 
            "data": "Tried this on today at my local retailer and had to have it. it is so comfortable and flattering. it's too bad the picture online has the model tucking it into the skirt because you can't see the ruching across the front. a little dressier alternative to a plain tee and reasonably priced for retailer. 5'8\"\" and i generally wear a 6, the small fit well. will probably be back for the black!", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "negative"
            }, 
            "data": "The fabric is so beautiful that i am tempted to buy in a large size and have re-made. the waist is tiny. the hips are wide. when it goes to half price, i may be tempted to take it to my favorite alterations lady. the fabric is that exceptionally beautiful.", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "positive"
            }, 
            "data": "This blouse is so beautiful - the collar, sleeves, material...everything except the cut! it was like a tent. it needed to be more tapered, which would be easy to do while still maintaining the beautiful breezy flow, and be about two inches longer.\n \n i had been drooling over this top for awhile and was so disappointed! please fix it and then i will buy again. i am 5'4\", 140lbs and busty...a small was perfect, with the exception of the massive amount of material.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "positive"
            }, 
            "data": "Cute little dress fits true to size. it is a little high waisted. good length for my 5'9 height. i like the dress, i'm just not in love with it. i dont think it looks or feels cheap. it appears just as pictured.", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "negative", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "neutral"
            }, 
            "data": "I loved the idea behind this shirt but it just hangs around the waist with tons of extra fabric. i suspect the model in the photo has the shirt pinned. totally unflattering making the chest look small and your midsection appear huge. maybe if you size down it would be better- xs was not available for me to try. also the lavender color is really washed out...", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "This is another one of those darned swing tops. i can't even with this trend. this shirt has such a nice print/color palette going on but it's ruined by the swing cut/henley combo- it looked like i was a little kid wearing an oversized men's night shirt/smock? i don't know, it was just not at all flattering. i ordered my regular size large and a medium would have worked and probably still been generously cut. i disagree with a reviewer who said it might work for larger sizes.. this just made my", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "negative"
            }, 
            "data": "In paper crown dresses, i wear a small or size 6, so for this top, i ordered a small. it was huge on me! for reference, i'm 5'7\", 130 lbs, 34a. it is very wide towards the bottom, and it flares out way more than in the picture. the material is also a little stiff, so it really sticks out. even if i sized down to the xs, i think the bottom would still look unflattering, so i'm returning this.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "After the reviews about sizing, i ordered the size 16 (am normally size large). interestingly, the tag on the blouse says it's a 14. with all that said, the blouse is cute enough and sizing up gave me enough length (in spite of the higher sides) that i'm considering keeping it. although it's a bit big, it flows nicely and isn't oversized in that wide, crazy way. the sleeves are a bit too big but they're cuffed with a button and can be rolled. the fabric is somewhat crinkled in texture. i got the", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "neutral"
            }, 
            "data": "I have been dying to try a mara hoffman bathing suit, so i went for this one. unfortunately, the design of the bathing suit is not like what they sent me. the middle where the tops meets the bottom, is squared off, not like that v that it looks like in this photo. it also makes for major side boob/sagging on each side. i was very disappointed.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "neutral"
            }, 
            "data": "I followed the advice of other reviewers and sized down from a s to xs. i was worried about the length of the torso since i'm long in that area, but the xs still worked great. it's a totally adorable jumpsuit with a nice fit. my biggest peeve with this was that it came dirty on the hems...like it had been dragged on the ground somewhere. unfortunately, there were no more xs online once i got it though, so i will keep and try to clean. this is not the first time in recent months that i have recei", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "positive"
            }, 
            "data": "I simply love this jacket. it's comfortable, soft and has a relaxed fit that is easy to wear. i wish i had bought mine while it was on sale.", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "neutral"
            }, 
            "data": "This is a great piece to help ease on in to the chillier days of fall and winter. it's versatile- i can see myself wearing it with plain short or long sleeved tees or even tops with more elaborate padderns or button downs! there's so many options i cannot wait to put this gorgeous piece to use! just as an fyi, the sleeve openings are slightly unfinished and have a frayed effect to them. this may not even be noticeable if you're not looking right up close. for me, this adds to the unique quality", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "positive"
            }, 
            "data": "I got a small mauve. the fit is great and the length is perfect for me, just few inches above my knees.\n cute and cozy! what more can i aske for!?", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "negative"
            }, 
            "data": "This top light and airy, which is perfect for spring. i'm usually into these types of blouses; however, this didn't quite fit right on me. it's a little too boxy and too low cut in the front for some reason. i loved the design and really wanted to like it... i just didn't love it enough to purchase it.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "positive"
            }, 
            "data": "Just ordered this in a small for me (5'6\", 135, size 4) and medium for my mom (5'3\", 130, size 8) and it is gorgeous - beautifully draped, all the weight/warmth i'll need for houston fall and winter, looks polished snapped or unsnapped. age-appropriate for both my mom (60's) and myself (30's). will look amazing with skinny jeans or leggings. we ordered the gray which is true to the photos.", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "neutral"
            }, 
            "data": "Don't try this on, if you don't plan to buy it. it feels amazing!!! i bought the black and it is a lovely charcoal color and matches so much.", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "neutral"
            }, 
            "data": "Great color, soft fabric, but waaaaay too long. more like a night shirt than a t-shirt.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "neutral"
            }, 
            "data": "When i first opened this dress and tried it on i thought it was adorable. it is very flattering on my hourglass figure and hides my recent baby weight. the problem is the hem. it was already rolling up when i took it out of the package, and i should have noticed and returned it, but i figured the problem would be easily solved by a good ironing. well, it wasn't, and it gets worse every time i wash the dress. it's like the hem isn't constructed properly.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "neutral"
            }, 
            "data": "If your hips are bigger than a size 6 us you can't fully close this robe. the model must be wearing the larger of the two sizes to have such a nice oversized fit. the fabric is soft and lux and amazing, but the weird dart in the back and the closure is right over my sadly size 8 hips and butt. if i was taller and thinner i would have kept this and worn it every day.", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "I loved this dress as soon as i tried it on, but... it bunched up weird in the front around my hips. i ordered a second size 4, hoping that it would fit better. but same thing. if i tried to go to a size 6 it would be too big every where else. fyi - i'm 5'8\" 129lbs and i'm a runner. it's not like i have a huge backside or anything. my guess is sizing is off. i've tried another of his dresses and it fit perfectly.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "This is such a beautiful dress. but have to return for the reasons others have noted. the chest does not fit well.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "negative"
            }, 
            "data": "I love the idea, and color, very flattrering and easy to throw on, however, i need the petite in this one, and they sold out in the neutral color. it looks too big in eregular sizing, and since it combines xs/s, it is made slightly bigger. material is soft enough.", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "positive"
            }, 
            "data": "It is the perfect top to wear in the summer, it is nice and you can be somewhat dressy or super casual. i don't like anything too tight around my stomach and this has a nice flow with just the right amount of material.", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "positive"
            }, 
            "data": "Love it; the bit of stretch in the denim makes it less stiff than traditional denim.", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "I thought it was only me and immediately assumed i needed to go on a diet when i attempted to put this adorable skirt on. it got stuck at my hips. i'm a very consistent size small in dresses and skirts. i actually thought about putting it on over my head but that was impossible. its going back. now i see the other reviews and am relieved that its the skirt and not me! wish i had read them before purchasing. retailer is going to get a lot of returns on this one.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "negative", 
                "Fabric": "negative", 
                "Fit": "neutral"
            }, 
            "data": "This is so thin and poor quality. especially for the price. it felt like a thin pajama top. the buttons are terrible little shell buttons. this could not have been returned faster.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "Super long even at 5'7\" and a little too voluminous for my taste. incredibly comfortable and beautiful pattern though. i'm having a hard time imagining there getting much use for me, so even at the sale price they're going back.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "neutral"
            }, 
            "data": "If you have any cleavage this dress will look awful. the ties drop pretty low & look trashy over cleavage. recommend otherwise - good fabric cool look", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "negative"
            }, 
            "data": "This dress was not what i had hoped! from the online pictures, i had high hopes, but the fit was really wonky and the material seemed cheap. the arm holes were too big and made the dress seem more like a bathing suit cover up than a classy summer dress. needless to say, it's going back!", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "negative"
            }, 
            "data": "Unfortunately i had to size down twice with their pants. great feel, they're soft and the grey is a soft color.", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "negative", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "neutral"
            }, 
            "data": "I read the previous reviews and had hoped that the exclamations about the color being inaccurate were exaggerated- however they are sadly very true. let me be clear that this is a beautiful, comfortable piece of clothing- when you put it on it feels thick and of very good quality. and while the pattern is interesting and pretty, the \"dark orange\" color i was expecting is actually a mud brown. i think it's unfortunate that retailer misrepresented such a key element of the jacket, but i digress. the", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "negative", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "neutral"
            }, 
            "data": "Great pants, like the edginess of the design in the material. kinda rocker like. soft material that's stretchy and hopefully will hold its shape during the day. the color is listed as black but it's more of a dark gray with a slight blue hint.", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "neutral"
            }, 
            "data": "Like other reviewers noted, the pics don't do this skirt justice. it is truly beautiful with an intricate lace pattern and rich colors. can't wait to wear this to work!", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "positive"
            }, 
            "data": "This top is great for spring- it's super light and can be dressed up or down depending on what you're wearing it for. fits true to size and is great quality.", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "negative"
            }, 
            "data": "Just purchased this- love how light and airy it is. perfect for throwing on on a warm summer day. it is soft and comfy, but it does run pretty large. i am normally a m, and in this the m was swimming on me. i purchased the s, and still loose and flowy. i wore a strapless bra with it, but will also try a bandeau or tank top.", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "neutral"
            }, 
            "data": "I'll start with saying that it's a beautiful coat- i get tons of compliments and love the color. it runs a little big but it's meant to have to a slouchy, oversized quality to it. my only complaint is that i've had it for about 3 weeks and already one button has completely fallen off and the two inside fasteners already feel loose and very delicate. there's no extra buttons to replace the old one with and i'm worried more of the coat is going to fall apart. super bummed about the construction qu", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "negative"
            }, 
            "data": "I love this dress for day and night time. the back detail is cute and works well with a racerback bra. it runs big though. i'm normally a small in dresses and the arm holes are too big in the size small on me. it was also generally too big all over. i like the length and the weight of the fabric. i purchased in the off black color.", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "negative"
            }, 
            "data": "This top was way too short (i'm only 5'1) and way too wide. the cut of this top was so wide, it looked like a tent on me. i really wanted to love this top because the material and style (sleeves, ruffle) are beautiful, unfortunately there is something wrong with the cut. i've have several blouses made by one fine day, which fit nicely, for some reason this top did not. i ordered in my usual s size, even going to an xs would not work because the cut is wrong.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "neutral"
            }, 
            "data": "This dress is beautifully constructed. it is very fitted and does run on the small side. it will be a perfect derby dress. the lace is lovely and the pearl buttons are great touch. age appropriate for anyone..a very \n pretty dress. simple, classic and gorgeous!", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "neutral"
            }, 
            "data": "I am now the third person to try this dress and return it for the same reason. the empire waist is too high and hits across the bust instead of underneath it. i can't imagine how they got it to fit this model so well. i am petite and i really love the idea of a maxi with sleeves, so i decided to try it even through the two previous reviewers reported this issue. unfortunately, i had the same problem. i am a c+ cup size. perhaps this would work on a very thin figure with a small bust. i ordered t", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "negative", 
                "Fabric": "neutral", 
                "Fit": "neutral"
            }, 
            "data": "A $200 piece of polyester with no shape and looks good only on the model. avoid ! mine went back the same day it came in the mail...", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "neutral"
            }, 
            "data": "This is a lovely pencil skirt that is well-made and really brightens a work day. like a lot skirts with multiple colors, a lot of tops feel like they should match but you have to try a few that really work with the skirt and your look to get the right impact.", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "negative"
            }, 
            "data": "This shirt would be perfect if i needed a canopy on my tent. this shirt runs ridiculously large. purchased a medium and it should be labeled an xl. no impressed with the pattern in person. looks cheap. will be returning.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "neutral"
            }, 
            "data": "I was really excited about this top since i have others from retailer that are similar in styling. unfortunately, it just didn't work out. i am petite with a short torso and ordered my usual size and it was way too short in the front. the top was also boxy and didn't sit right. it just wasn't flattering. cute top on the hanger, but just not on me.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "neutral"
            }, 
            "data": "Really cute and very comfortable. material is thin and sheer. i wear tanks under things anyway, but especially in pink, you would need to. but love the style.", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "positive"
            }, 
            "data": "Nice fit and flare style, not clingy at all. i got the grey color, petite large, fits perfect. will wear with tights/boots or booties. lots of color options to accessorize with.", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "I read all the reviews and was hoping that this top would work for me, but it did not. i ordered a size smaller than usual and it was still way too big. it was not flattering at all on my curvy frame. overall, it looked more like a maternity top on me then anything else! if you're tall and slender, i think this top would work!", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "positive"
            }, 
            "data": "Unlike the other reviewers, i did not have any problem with the sizing, fit or length of this skirt. it is a midi skirt so i think it's suppose to be a little bit longer?? for me it fit true to size. for reference i am 5'8\", 135 pounds and the size 6 fit perfectly. i think the color is beautiful and the quality is good.", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "An absolutely gorgeous, but poorly fitting blouse. the bottom part is way too billowy and inconsistent with the fitted top half. got it on sale and still returned it.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "negative"
            }, 
            "data": "I'm usually an xs for most retailer dresses and shirts. i ordered up per other reviews and got a small. the small fits comfortably around my waist. the chest area is not made for large chests. my 34ds were barely contained. sad to say, i won't be keeping the dress. the layers, fabric, and colors are truly pretty but the design/fit is disappointing.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "negative"
            }, 
            "data": "I bought this online so didn't realize that the fabric at the bottom is very, very stiff. i was expecting something silky, or at least on the softer and more moveable side. the best description i can think of is an overly starched mens dress shirt. that being the case, it kind of juts out in weird places. the sweater part is very nice, but it is somewhat closer fitting than what it seems in the picture. the fabric bottom is too ample for the slimmer design of the sweater which just adds to the o", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "neutral"
            }, 
            "data": "This shirt caught my eye because of how beautiful it was. i love the shape, design, and and the color. it's perfect for spring and summer with some white pants. unfortunately, i don't see any possibilities for this shirt to be worn any other way. so far, it doesn't work with any of my jeans, skirts, or shorts. i usually prefer items with more versatility for outfits, so i'm still on the fence if i'm going to keep it or not. with that aside, it seriously is a great quality shirt with a beautiful", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "This skirt is very pretty, but not only does it run small but only a small portion of the waistband is elasticized, so there's very little stretch. for those of us with a significant difference in our waist and hip measurements, there's no way to get this skirt on past the hips.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "positive"
            }, 
            "data": "I was obsessed with this dress from the moment i saw it online and was so excited to buy it for my company christmas party. i'm 5'4\", 36c, 145lbs and i ordered a 6. the size was great but the whole cut of the dress was completely off for me. i have a fairly short torso but the top portion of the dress (which is a sweater-like material) hit me far too low on my waist to be flattering; the petite may have fixed it, but then the skirt would've been too short. the pleats were cute but flared out too", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "I ordered this in a small petite and medium petite , and i am a huge fan of a*k. i put tried on the sp. while it fit, it was very long, even for a petite. what i hated about it was that the piping on the top made me look very wide. even a long necklace wouldn't help deter the look. on a positive side, the blue was a very nice, cool color. i am usually a small to medium in a*k (6-8 in tops) and the small fit well in the arms/bodice, just too much fabric for me. returning!", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "negative"
            }, 
            "data": "These run small (i am 110 and got a size 4), they were a tad tight on top. the waist fit but felt a little too snug, short from waist to crotch and then bloomed out in a nice but stiff ish material. they are a dark blue animal print. i felt like bozo the clown goes to the jungle. they looked so silly i had to laugh. even with the 20% off, these are going back. not even comfortable to lounge around the house in never mind being seen by anyone in person!", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "neutral"
            }, 
            "data": "Beautiful colors and silhouette (i got the navy). the skirt is lined and flows wonderfully when you walk. i've gotten a ton of compliments on it. i'm 5'9\" and the high hem falls a few inches below my knee, and the low hem falls to my ankles.", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "I wanted this dress so bad for a trip to hawaii. i sized up when i saw the side zip because i'm a little larger in the top than bottom, but whoa... even when sizing up, i think i would have needed to size up like 3x to get this to work. the dress is adorable, and if you have a smaller bust, it will work for you... so sad it wouldn't work for me.", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "neutral"
            }, 
            "data": "It is definitely pinned back on the model in the photograph. it made my 5 foot frame look short and wide.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "I have been searching for the perfect denim jacket and this it! i love the darker color, more modern day less 80s. it runs a little small. i am always either a s or xs at retailer. lately, their clothes seem to be running a little bigger, so i have been an xs in most tops. when i order online, i never know which size to get. i ordered an xs, however it was very tight in the arms and across the shoulders. i wanted to be able to roll the sleeves up, so i returned it for a s and it fits great. i was", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "negative"
            }, 
            "data": "Wasn't sure about this top based on reviews, but glad i purchased! pretty print, looks great with denim. very loose, flowy top. hangs a little short, but that's the style of this blouse. fit true to size. i usually wear a 2/4 and xs/sm with 30dd. size small worked for me.", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "neutral"
            }, 
            "data": "I wanted to love it - the color is great, the embroidery pretty, but the stiff scalloped sleeves were just too much. if you have broad shoulders this is not the shirt for you. i think personally it would have been better had the material been softer.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "Online, this looks like a great sweater. i ordered an xxsp and found that this sweater is much wider in the middle than pictured. in fact, i'm pretty sure they pinned the shirt in the back for the picture to make it appear slimmer. unfortunately, this sweater will not work for me, as i am an hourglass shape and this shirt makes me look 20 pounds heavier.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "positive"
            }, 
            "data": "This is a nice shirt, but i can't keep it. i ordered a 0 and i do have an athletic build with somewhat wider shoulders given how petite i am (usually wear 00 petite in all pants) and i think this size was perfect (fit across the back perfectly) when you lift your arms the way it is cut makes it really tight across the chest and shows your stomach. at the same time, the high low styling makes for a really strange shirt-tail in the back. i'm sure this is the trend but it really does not look cute", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "negative"
            }, 
            "data": "I ordered this top in my usual size and am exchanging it for one size smaller.\n it runs very generous, and so the sizing is a little off.\n the style and quality are beautiful, so i am anxious to receive the smaller size.", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "positive"
            }, 
            "data": "I loved this jumpsuit. it fit well on my curvier/athletic frame. i did prefer a belt, which emphasized my shape. unfortunately, it is not lined and a bit sheer. this was a deal breaker for me.", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "neutral"
            }, 
            "data": "This top is super comfy and casual. the slit/design in the front gives it more of a stylish look than your average white long sleeve tee. would definitely recommend.", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "positive"
            }, 
            "data": "I was able to snatch this dress up just before it sold out (and i see it's now back in stock!). the quality of the fabrics is outstanding, not flimsy at all. the top is stretchy. normally i would wear a 2 at retailer, but the only choice i had was 0 and it fit. i am 5'5\" tall, 125 lbs. everything about this dress makes me smile and i can't wait to wear it to my holiday party! don't hesitate if you are on the fence.", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "positive"
            }, 
            "data": "I agree that this blouse is boxy, but because it's not too long in length it evens it out. any longer or shorter would make it look too boxy. it's great for work to dinner during the week & goes great with jeans too.", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "positive"
            }, 
            "data": "You guys, i love this so much! however, within one hour of wearing it, the back seam completely ripped. it fit me perfectly... sadly I'll have to return the damaged item. really sad it's all sold out too!", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "neutral"
            }, 
            "data": "Very comfortable, material is good, cut out on sleeves flattering", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "neutral"
            }, 
            "data": "I ordered the green, black and ivory because i thought they were so cute. the sweater is short but still cute. the ivory one i will return though. it has sparkle that's not noticeable in the online picture plus when it arrived it had a huge snag in the fabric. i'm actually quite surprised they sent it to me in such poor condition.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "negative", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "neutral"
            }, 
            "data": "This pants the worst short that i ever had!!\n i bought this short last week and i laundry it yesterday and it came out lost color!!\n i was really shock definetly will return it to store.\n fyi, i never use chrolox or bleach when i laundry.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "This is as beautiful in person as online, but the length is shorter than the description, and the arms are tight! although i am 5'1\", i normally wear regular sizes in retailer just fine; however, the 28\" length scared me off, so i ordered a 2p. it says it's 26.25\" long, but it's actually just about 24\". and my normal sized arms struggled to fit into the sleeves - yikes! but it's gorgeous and was purchased with a gift card, so i will keep :-)", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "I found that this dress ran very small. i am true 8, ordered a 10 and it was snug", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "negative"
            }, 
            "data": "Not a tunic unless the model pictured is 5'1. barely covered my backside and not as advertised. design on top is interesting and the fabric is soft so it's a good buy if 50% off or more.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "negative", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "neutral"
            }, 
            "data": "I was looking for a shirt of this style. i thought it was very cute, but it is not \"red' as advertised. it is really a brick orange-y color, which is definitely not what i wanted. very disappointed. sent it right back.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "neutral"
            }, 
            "data": "The sweater is cute, but scratchy.", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "negative", 
                "Style": "neutral", 
                "Cost": "negative", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "These leggings were way longer and darker then appeared on model. \n they also were see through or beige color when stretched across hip.\n especially for the high cost, there are much better althleisure leggings on the market.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "positive", 
                "Cost": "negative", 
                "Fabric": "negative", 
                "Fit": "neutral"
            }, 
            "data": "I gave this four stars only because the lining has some polyester (poly/rayon blend) in it and i don't like polyester; still, i couldn't pass it up due to the chic look and the oh so warm feel of the coat. it's like wrapping yourself in a warm blanket and the wine color looks amazing! it's a little on the pricey side. since i consider it more of a sweater than a coat, i would have liked the price better if it was $100 less. it was one of those items that was hard to take off once i put it on. i", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "negative", 
                "Fabric": "negative", 
                "Fit": "neutral"
            }, 
            "data": "Very cheap looking material. looks cheap to cost $158.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "positive"
            }, 
            "data": "I didn't think anything of this top online (i really don't care for how they styled it) but in store it was more interesting. i'm currently anywhere between a 2-4-6 / xs-s-m, depending on the style, 5'3\" 120lb 34b. size 2 regular in this top fit me perfectly. for some reason, on me, the sleeves were elongating and flattering (closer to my elbow) and the overall length hit me perfectly at the hip like on the model, the fabric is lightweight and therefore slightly sheer but, due to the color and p", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "negative"
            }, 
            "data": "Ranna designs richly detailed dresses and this is no exception. looks just like the pictures (colors/cut/drape) with the exception of a modesty hook at the deep v-neck. sleeves are sheer with an elastic cuff. this dress does not stretch--the bodice felt very fitted and tight, especially at the waist band. runs true to size or small; if you're busty/broad shouldered, size up. it has a dreadful side zip, is fully lined and all synthetic fabric (boo!) i purchased size 10p, my stats 36c/38-27-35/135#.", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "positive"
            }, 
            "data": "Saw this online and went in to try on. fit great and is true to size, but i should have known there would be issues as three out of six on the rack had the sewn in tags were all but hanging by a thread. i bought this for my bachelorette weekend in napa and when i put this on i noticed the straps had a few threads coming out and i thought, better get this to the seamstress as soon as i get home to secure the straps. well, literally five minutes into the car ride to the wineries i noticed the seam", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "neutral"
            }, 
            "data": "The beadwork is gorgeous, but the sleeves are so puffy, it looks as though you're wearing shoulder pads. the fabric of the shirt isn't that fabulous either.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "negative"
            }, 
            "data": "I was disappointed with this jumpsuit. when i first saw it in the store, i thought i was going to love it. when i tried it on, the first issue is the fabric is too sheer. i could completely see the outline of my underwear and bra. it also runs way too big! i know the bottom is supposed to be loose and flowy, but the waist needs to be more tapered to off set that, and it's so baggy. the arm holes are also cut very low, so when you lift your arms you can see most of your bra on the sides \n i wante", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "negative"
            }, 
            "data": "Like another reviewer mentioned, this shirt is way too short. i'm only 5'2\" (xs) and there is no way this top would tuck in like on the model. also, the quality isn't great as it's very thin and there are strings hanging from some of the seams in the front. it's a shame because the print is really pretty and there is this cute little bicycle charm on the tag which makes it feel more unique. sadly, it's going back!", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "negative"
            }, 
            "data": "This dress seems quite high quality and is wonderfully designed, except in the chest. the wrap style hugs in all the right places but the chest. i'm slightly large chested (34c/d) but can usually wear a size small or size 4 in dresses and tops (5'5\", 122 lbs). the small in this dress was great everywhere else, but i couldn't breathe and it totally flattened out my chest. also, it is quite low cut, so another mark against it for anyone with a semi-large bust. couldn't wear it to work that reason", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "negative", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "neutral"
            }, 
            "data": "This is silly, but the moss is not brown as pictured but olive green. with that \"said,\" i am going more casual, and i love the \"flex\" of this coat. the shape is beautiful and the lining is fun. i waited two months to get this in close to my size 00. for my style it is a keeper, but this back order situation is not acceptable. don't know whose fault that is?", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "I loved the color and design of this dress but needed to return it because it fit so poorly. the arm holes are entirely too big -- so big that alternations couldn't fix it. maybe it's because i am petite but i think it may be a design flaw.", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "I bought this item from online... the fit on the model looked a little loose but when i got mine it seemed a bit tight! so i took it back to the store & ordered a larger size. for the sale price this is a great top.", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "neutral"
            }, 
            "data": "I love this dress because its very playful and bouncy. it puts me in a light hearted mood when i wear it. i originally wanted to buy the grey color but my store only had the navy, so i tried it on. the navy is brighter and more colorful than it looks on line and the stripes are more varied in color than in the picture - so its quite appealing and vibrant. the lines of the dress are also quite flattering. all in all, its a fun dress!", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "positive"
            }, 
            "data": "I had it on my wish list for a long time, not sure whether i should purchase, i even hesitated when it went on sale, but boy, am i glad i did order it... it is crazy comfortable, flattering, and love that it looks black but is blue... i ordered both xs and xs p and decided to go with the petite as it will look super cute in the fall with boots. not too short (i am 5 foot 1.5)... the fake leather part concerned me at first, but i like it now... nothing bad ot say about it!", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "I loved this dress. it runs small (i'm normally a 2) so i had to get a 4. in the fitting room, the zippers got stuck a lot. i assumed it was just from the way the waist was sewn in. finally i found a dress that would zip pretty well. \n \n i went to put on this dress for my rehearsal dinner the night before my wedding. my fiance and i tried in vain for 20 minutes to try to zip it up... and then it broke. the part that was zipped became unzipped and the zipper had no where to go. it was awful. i co", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "positive"
            }, 
            "data": "I'm 5'2 around 125 lbs, muscular and petite, so i ordered a petite small and it fits great. the length is perfect, i can wear with heels or dress down with flops. it's lined, which i think most dresses and skirts should be, so i was happy about that. i was pleasantly surprised with the slits up both sides, to show a little leg....sexy. it's not too low cut that you have to wear a cami and ruin the neckline, so that's plus. my only issue was the fabric didn't line up on me the same as the model,", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "I'm 5\"5' and 125 lbs. i ordered the s petite to make sure the length wasn't too long. i typically wear an xs regular in retailer dresses. if you're less busty (34b cup or smaller), a s petite will fit you perfectly (snug, but not tight). i love that i could dress it up for a party, or down for work. i love that the tulle is longer then the fabric underneath.", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "neutral"
            }, 
            "data": "I purchased this sweater in a small . nothing on the web site states it has dolman sleeves! it looked sloppy and made my bust disappear! it went back i hate dolman sleeves.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "I really wanted this to work. for me the arm cutout was too wide. a cap or lace flutter sleeve would've worked . also expected a little more length felt like the petite length.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "negative"
            }, 
            "data": "I ordered these because of the side zipper, but they zip in front, even though the order listing and bag label called them \"wine, side zip pants.\" they were also at least two sizes larger than marked and very flimsy material. what bothers me is that i was charged $5.95 to send them back, even though the product description (and the name before someone changed it on the website) were wrong.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "neutral"
            }, 
            "data": "This dress looked gorgeous in the monthly catalog. ordered in hopes to wear in easter. i felt it was frumpy and just ok. color was pretty but overall; i didn't love it like i hoped to.", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "These were a little baggier than expected and the petite size ran long.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "neutral"
            }, 
            "data": "For a now feel, that comfy and well made, this was a great choice!", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "negative", 
                "Style": "negative", 
                "Cost": "negative", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "This shirt was so weird it does not fit like the photo at all. there seems to be missing a stitch or something at the top as it is wide open until the bottom/where it meets the other layer. i could wear a tank/camisole underneath, but it still just did not fit right. i do not have a large chest, but this was ridiculous. beyond that, the red color was just okay. even though i purchased this on sale, it was not worth the price and i returned.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "negative"
            }, 
            "data": "I got this top to wear with shorts as the color goes with a lot of different prints. the quality is excellent. this top runs very large, as in three (3) sizes too large. for the record i am a 34.25.35 and ordered my regular size the xs and this top makes me like i'm pregnant with twins. also, the layering looks nothing like it does on the model, it looks sloppy, unkept and a general. i think this would still be great for ladies who are bigger in the chest and waist, otherwise it just doesn't wor", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "neutral"
            }, 
            "data": "Top of the line! very well made and on sale to boot. i love the style and received a compliment from my sister when i wore it. i love the layered look.", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "neutral"
            }, 
            "data": "Is not a place i want to be, even if the style of a sweater is great. yes, this sweater is very cropped, but i think it's definitely intended to be worn off the shoulder to drop the waist a bit. it's the itchiness that makes it an immediate, and that's coming from someone who has serious fiber itch tolerance.", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "negative"
            }, 
            "data": "These are really cute. nice fabric. i love the rise...not to low, not too high. but they are going back. i'm a size 4. i got these in a 4. they fit fine in the waist and bum but they are tight around my calves. also, they were more like \"high waters\" on me than cropped so a petite in the length probably would have worked better for me had these fit.", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "neutral"
            }, 
            "data": "I ordered this in my usual size small (36b bust, 5'5\", around 116 lbs), but the seam around the high waist stuck out and didn't cinch in at the waist at all, rather bubbled out a bit. the tunic \"flaps\" laid strangely as well, like they were too small almost. the high cut sides were indeed high cut...showing the waistband of my leggings. apparently that is a new style, as i have seen a few other tops like it around, but i question whether slits that high are appropriate for actual wear outside on", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "negative"
            }, 
            "data": "Runs a size big unless you want it really boxy. felt the material was flimsy and would probably pill soon. turquoise was a pretty color but returning this one.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "negative", 
                "Fabric": "negative", 
                "Fit": "neutral"
            }, 
            "data": "The fabric clung to my body i expected it to flow and be breezy, it was too flimsy, the arms were too wide and overall for $100 this dress didn't cut the mustard. i'm 5'7\" 135 the dress was long enough, just didn't flow very well.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "neutral"
            }, 
            "data": "Absolutely in love with this shirt. the neckline is extremely flattering, and the shirt naturally comes away from the body.", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "neutral"
            }, 
            "data": "I liked the color of this top but i didn't really like the ruffled stitching around the middle. it looks like someone just tacked on the bottom half. i bought this for my daughter and she likes it. i think it is comfortable and a good top to knock around in.", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "I bought the shirt in ivory and went down a size per the advice from other reviewers. what i should have done was go down 2 sizes! runs huge! my husband said i looked pregnant and that's never a good look if your not. sent this back the same day.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "positive"
            }, 
            "data": "I just purchased this beautiful printed blouse in the pink color and love it! i almost always wear a size small at retailer (34d-27-35) and the fit and length are both perfect on me. if you are smaller chested you can easily go down a size. i absolutely had to have this when i first saw it at the store and noticed how popular it was as i had to order it due to it selling out like hot cakes there. what i like about it is the texture and the ruffles at the front plus the length of the sleeves stop", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "neutral"
            }, 
            "data": "Love the design of the fabric. i actually bought these in both colors. i gave only 1 star due stitching on the fabric, it's very scratchy.", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "negative"
            }, 
            "data": "The inseam is advertised as 28\", but they are more like 38\". i was hoping they were for short people, but they are for someone with very long legs, event in my tallest heels, i'd have to get them hemmed! just a warning to my short friends out there. the quality, fit, look was great, but way way way too long.", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "neutral"
            }, 
            "data": "This dress looks and feels cheap. the white material is stiff and does not iron nicely. the grey sweater is super thin and very cheap looking. overall, a pretty horrible dress. save your money,", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "negative", 
                "Style": "negative", 
                "Cost": "negative", 
                "Fabric": "negative", 
                "Fit": "neutral"
            }, 
            "data": "I really like the sundry brand. however this is thin and to me out of character for an retailer tee. it look adorable in picture. however the coloring is way off. the navy is almost black it's so dark and the kaki stripe is a green. it's nothing like i had hoped it would be. fabric in very thin and more like a pajama top. so disappointed. it will go back. i do not make it a habit to bash a product. however with tax, shipping and 83.00 price tag. 103.11 is absolutely terrible.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "negative"
            }, 
            "data": "Dress runs small esp where the zipper area runs. i ordered the sp which typically fits me and it was very tight! the material on the top looks and feels very cheap that even just pulling on it will cause it to rip the fabric. pretty disappointed as it was going to be my christmas dress this year! needless to say it will be going back.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "neutral"
            }, 
            "data": "I have already worn this several times. it is very flattering, lightweight, and easy to wear. dressy but also very soft and comfortable.", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "neutral"
            }, 
            "data": "This dress is not what i expected. the bottom half is wool-like material-looks like someone has worn it. the top snags easily so you must be careful when wearing jewelry. when i received the dress i noticed there were two small holes under the arms. i wouldn't have paid full price but for the amount, i sewed up the holes and packed it away for winter.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "neutral"
            }, 
            "data": "Got this in the mail today and while the design is cute, it's not as soft and comfortable as i would like. the front clasp takes a bit of practice to get on and off. the straps are a bit thin and hurts a bit.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "neutral"
            }, 
            "data": "I loved this shirt until the first time i washed it. it shrunk so much it became unwearable. when i returned it the salesperson said she had also bought this shirt and the same thing happened.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "I love the way this t-shirt fits. the horseshoe opening in front is deep enough to add interest, but not too revealing. will look great with layered, dainty necklaces. the sleeves are nice and long - and i have long arms. the length of the shirt itself could be an inch or two longer, but overall the design is nice. not too tight, not too loose. i'm 5' 5\" and 125 lbs - 34c and the small fits me well. fabric is medium weight - could be a little thicker. the brick color is nice and works great with", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "negative", 
                "Fabric": "neutral", 
                "Fit": "positive"
            }, 
            "data": "I love this jacket over a dress! it's snug fitting so can't wear anything bulky under it, but super stylish and comfy stretchy material. it's a bit pricey but i get a lot of wear out of it so worth it to me.", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "negative", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "positive"
            }, 
            "data": "I received this skirt today and was very disappointed. i don't know what i expected but it is not as i thought. even though the quality is very good and the fit is true to size, i may return it. the fabric of the skirt is just too busy, at least for me. i am just uncertain and even though i have many tops, the colors are just not matching. white looks better than any colored top with this particular print. i am going to try it on one more time and make a definite decision.", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "negative"
            }, 
            "data": "This dress is most definitely not a maxi! barely goes below the knees. also you do not get the cute detail shown on bodice. there are no folds which were an added plus on picture. waist is higher, not at natural waist. very pretty silk though and still cute. just not as pictured.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "Like others reviewers mentioned on here, this dress is extremely well made. but there were too many cons for me, as well. this would most certainly work on a petite/shorter frame, but for tall, busty, and curvier girls, it just sits wrong on all places unfortunately. the color is lovely along with the nice collar that ties in the back really made this dress stand out.\n \n however, i'm a 36c and found that the arm/shoulder part so large and bulky that is made me look bigger on top. there was entirel", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "neutral"
            }, 
            "data": "I ordered online. i sized up one size. it fit perfect. so flattering and so pretty. then i tried to take it off and the zipper stuck...badly. 30 minutes later i was sadly packing it up to ship back. the zipper is that awful.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "positive"
            }, 
            "data": "I love the color of this skirt, and the fabric is wonderful. it was a bit longer than anticipated, but fit well.", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "negative", 
                "Fabric": "negative", 
                "Fit": "neutral"
            }, 
            "data": "This is an adorable basic & i should have been wearing it once a week this summer, but instead the fabric developed noticeable holes after the very first wear. this brand makes some of the softest, cutest tees, but unfortunately more often than not are unwearable after the first or second wash. i wash on gentle & hang dry. not worth the cost.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "I am in need of easy comfortable tops for everyday wear. i bought this top mostly because of the cute buttons. when i received it, it looked exactly as it does in the picture online, however, the buttons kept slipping out of their homes because the holes were slightly too big. the shirt fit but was just a tad snug near the upper arms, which would stretch and loosen up throughout the day. it's definitely a comfortable shirt, but it felt more like a pajama top. it's going back.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "I really like these jeans, but order a size down. i'm typically a 14 and these were just too big. they stretch as it is and although they should have a baggier fit, they are just too baggie.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "positive"
            }, 
            "data": "This dress is comfortable and stylish at the same time. it runs true to size. i'm 5'1\" 113 lbs and got the xs petite. wore it once so far for a few hours and got a few compliments on it!", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "negative"
            }, 
            "data": "I wanted to love this. couldn't wait for it to arrive. unfortunately, it doesn't look anything like the picture. i usually wear a m or L in holding horses so i ordered a L but as soon as i held it up i noticed it was ridiculously large. the fabric is on the heavy side so the dress just hangs in a very unflattering way. and, it is extremely shimmery. i love velvet, but the texture and sheen of this dress was just over the top. sadly, it is going back.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "Perfect little summer tunic that is very flattering. paired with a skirt, jeans or cropped black pants- this top is perfect! the cut in the front is not overly deep- so a cami is not necessary. i am usually a l or xl or 12 in retailer tops and i have a 10 in this top. so it is sized slightly larger than usual.", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "neutral"
            }, 
            "data": "I am usually a petite 6 but since this dress did not come in petites i tried on 4 and it fit. i'm 5'1\" - 112lbs so dress hit right below knee - will have it hemmed up a bit do not so overwhelming.\n \n this dress looks stunning on! great vibrant color ( i have dark hair) makes this classic elegant dress look contemporary and stylish. when i tried it on in store, salesperson and others who happen to see it on me raved and told me to grab it! i did and am glad.\n \n i plan to wear it this spring for my daughte", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "neutral"
            }, 
            "data": "The problem with off the shoulder tops is that the neckline is totally elastisized , therefore upon any movement of your arms the top pops above your shoulders making it go from stylish to matronly . the only elastic should be right at the shoulders , the rest of the neckline should be a simple finished hem. .", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "negative"
            }, 
            "data": "The fun colors drew me to this but it sure fit weird. the top was fine but it became a bit tent-like in the waist. the material doesn't feel great either.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "neutral"
            }, 
            "data": "I live in los angeles and this is the perfect beginning of fall jacket! i've worn it with dresses and with jeans. definitely has enough extra room to slip a hoodie or small seater on underneath when it gets colder. it's soft and stylish. the only downside is that the pockets aren't really deep enough to put anything in.", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "negative"
            }, 
            "data": "This one didn't work for me. there is no zipper, you climb into it from the very large neck hole. it was very low cut and the shoulders kept sliding off but the bottom half fit snug. the tie and waist seam didn't hit at my waist but the largest part of my middle. i tried other belts and it wasn't much better. the fabric and print were great. i love jumpers but this one went back.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "negative", 
                "Cost": "negative", 
                "Fabric": "negative", 
                "Fit": "neutral"
            }, 
            "data": "Bought this item on sale and was very disappointed in the quality for the cost. fabric feels cheap, like it will snag easily and will stretch out quickly. did not flatter the female form- felt like a burlap sack. gorgeous blue color but not worth the price tag. returned it.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "positive"
            }, 
            "data": "This top is so much prettier in real life than it is on the model. the pattern and texture are both lovely, and the peplum is surprisingly flattering. it is definitely on the short side, but i think that gives it a modern look. the fabric does not stretch at all, but i still think it fits true to size. if you have a very large chest you may want to go up a size, but otherwise i would order your normal size.", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "neutral"
            }, 
            "data": "I really liked this shirt the one time i got to wear it...but when i washed it, according to the directions on the tag, it shrunk! a lot! the sleeves are now too tight, and it is much shorter. thinking about returning it to the store, but in any case, i cannot wear it again.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "neutral"
            }, 
            "data": "This is a great shirt that goes with everything. it's super sexy and i have to say....the girls look great in it! i bought the black first and went back for the green. the quality of the shirt is great...not cheap and no smell, at least not in my experience, like was mentioned by another reviewer. i can't say enough about how cute this shirt is!", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "negative"
            }, 
            "data": "I love mixed media clothing, and this is no exception. i fell in love with this right away, and after being torn between the two colors, opted for the rose. it's very gorgeous in person - midweight and very soft. however, as soon as i put it on, i noticed the knit sides truly flare out; they don't lay nicely like on the model. it could be because of my large chest (36dddd), but everything below the chest seems to widen me. it might work better on someone with a straighter build or smaller chest.", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "neutral"
            }, 
            "data": "The top is nice, good quality, etc.... but how do you keep the 'off the shoulder' off the shoulder? mine keeps inching up until it's just a boring white top with a strange loose neckline.", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "neutral"
            }, 
            "data": "I have alst year's version,a dn they are essentially the same, minus some leather parts removed... this jacket is great, the back is a little shorter, so it goes so well with peplum tops an dresses with higher waists (without looking bigger from the back when the hem is longer and hits where the skirt aprts bulge out). i love the darker color, i wish it came is super dark rinse...\n \n i usually buy petites, but i never tired on the petite in this jacket... i am holding myself back to order this on", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "I had reservations about this top based on other reviews, but it looked cute on the model so i took my chances. i have an athletic build--not model-thin, but not dumpy either--and this top made me look very frumpy and matronly. the sleeves were especially unflattering. i purchased it in an ps and might have done better with a pxs.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "negative"
            }, 
            "data": "Right out of the bag, this top didn't really match the one pictured here (it is the right top, though). the fabric was heavy and felt \"damp\" -- the way something feels coming out of the wash. very odd.\n and the fit is nothing like what's shown on the model. the \"v\" is not fitted or nicely wrapped (or even tacked in place) -- it was just two loose, droopy pieces so most of my bra was showing no matter how many times i put the pieces back where they belonged (i'm neither \"flat chested\" nor \"busty\"", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "positive"
            }, 
            "data": "I got the navy stripe version of this shirt and it has a very cute nautical vibe to it. i am either an xs or s in antho, and went with the xs for this shirt as i think the s would be too boxy. normally i would have overlooked this shirt as it's rather unimpressive on the hanger, but it was on sale so i tried it on. very cute when tried on! it fits well across the shoulders but isn't too clingy in the body, which i like. the fabric is very comfortable and the shoulder detail gives it a little mor", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "negative", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "neutral"
            }, 
            "data": "I read the cleaning instructions label carefully. followed them closely. and still, the dye ran and stained some of my colored clothes. pissed me off! just after the first wash and even before wearing them, i have streaks of uneven color on the pants. bad quality material or dye is what causes this. now i have to go and see if i can even get out my other stained clothes. thanks a lot retailer.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "neutral"
            }, 
            "data": "It looks great on the model but not on me. on me, it looked more like a sack of potatoes. the fabric is unexpected for the style in my opinion. it is very thick. i'll be returning it because it is not flattering on me.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "The blush stripes are subtle but they definitely give elongating effect to your legs.\n \n very comfortable pair of crop pants but my calves are definitely feeling tight in there!", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "neutral"
            }, 
            "data": "I love, love, love this jumpsuit. it's fun, flirty, and fabulous! every time i wear it, i get nothing but great compliments!", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "Other reviews are correct. but this has potential to look as good as on the model - structure and quality of the cotton are very flattering. makes legs look miles long. however this fits very tight, allows no room for extra tummy, hips, booty, or thighs. i ordered a s (i'm usually a 4) - was able to get it on (step into it from the top), but felt a little self conscious about how tight the fit was. if there was an m, would have definitely sized up, as i really liked the look.", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "neutral"
            }, 
            "data": "Cute top but started disintegrating after two washes. the delicate cutouts in the top tore apart. i machine washed it in the gentle cycle and didn't use the dryer. disappointed to have to discard the top after just buying it.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "neutral"
            }, 
            "data": "I was minimally torn over whether to return this but ultimately it's going back because the knit is just too thin. i thought it would be cozy and be of normal sweater weight but it's not. and because it's so light, the swing effect doesn't really come off. nothing special.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "After reviewing the comments for this dress i was really hesitant about buying it online, so i finally went to the store and all of the reviews are 100% true. this dress is amazing in terms of quality, but the sizing makes zero sense. i'm normally a size 12, but based on the reviews i initially tried on a medium. even that was huge, arm holes so long you could see my entire bra. so i tried on the small and that fit perfectly. unfortunately, unless you're normally an 8(maybe) or above in sizing,", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "negative"
            }, 
            "data": "I was hoping to find a slimming and cozy sweater, unfortunately this one was baggy and material was really bulky. one of those occasions where i would have never purchased this in person but online you can't quite tell the style and fit. i returned this item.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "negative"
            }, 
            "data": "I really wanted this to work. alas, it had a strange fit for me. the straps would not stay up, and it had a weird fit under the breast. it worked standing up, but the minute i sat down it fell off my shoulders. the fabric was beautiful! and i loved that it had pockets.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "neutral", 
                "Cost": "negative", 
                "Fabric": "neutral", 
                "Fit": "neutral"
            }, 
            "data": "This pants look pretty much exactly like the picture except these will wrinkle really easily so there is no way they will ever appear as wrinkle free as the pic.\n \n i found the color to be exactly as seen online so i am not sure why others didn't. the material is really light weight so i think these will work well for spring.\n \n overall cute especially for the price. if not on sale, i would not have bought them but the sale price makes these pants awesome.", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "This is a really cute dress, just did not look flattering on me at all. i suppose i could have gone down a size, however i just did not love it. i am 5'3\" 130#, athletic build, 36dd. i read the other reviews and everyone loves this dress. here is what i did not like. there are pockets, which i cannot figure out the purpose, that lay oddly all bunched up right at the hips. due to the shape of the dress, it bunches out. on my short frame, it made me look shorter and wider. the fabric is a lightwei", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "negative", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "neutral"
            }, 
            "data": "The color is darker than shown (i ordered the denim looking one). the flower things are not very visible as it all looks one color. it must be great for the tall skinny model , but if your 5'4'' and pear shaped like me, it's a no go! took it back to my local store.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "I agree with the other reviews - runs small. would have been perfect if it actually was comfortable. waistband doesn't stretch all the way around. bummer.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "I bought this online. this looked like a sweater that was accidentally shrunk in the dryer, when i received it.\n \n i will be returning this.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "negative", 
                "Fabric": "negative", 
                "Fit": "neutral"
            }, 
            "data": "I bought this online with the intention of it being my graduation dress. i'm 5'2\", 115 pounds so i should've known better and gotten a \"petite\" style dress. however, i loved the modern look of this and since my boobs are a bit bigger (34d) i figured they would help fill it out. upon receiving the dress, i was first shocked that for the price, the construction was pretty poor quality: there were strings coming out of the straps and they looked unevenly sewn. when i put it on, it was clear that th", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "neutral"
            }, 
            "data": "Wanted to love this dress - pretty fabric and colors. i think it would be more flattering on a taller woman (i'm 5'3\", ordered a s), this just looked like a nightgown on me. sorry to say it's going back.", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "positive"
            }, 
            "data": "I had been eyeing these for a while, but as they didn't seem very popular, i figured i'd wait for a sale. i finally bought them at the 40% off of sale price (yay!) and i love them. they're extremely comfortable, and very flattering. i'd say they run true to size, but maybe on the smaller end of the size for the waist. the blue pants are more greenish in color than the picture shows, but still beautiful. i'm looking forward to wearing these now and into the spring.", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "Some reviewers found this skirt to be on the smaller side, but for me, it was big,,, too bad the smaller size is sold out (well, all peittes are sold out). the length is also pretty long, below the knee, but in the narrow part still...so able to keep it. the colors are great. i brought it in the store to try on in front fo the stylists, and they all loved it and told me to keep it... winner for sure!", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "negative"
            }, 
            "data": "I love the colors of this dress, and i waited for the sale since it isn't really good for work. i wear size 6 in hd all the time, but this one doesn't fit at all on the top. the bust is cut for someone really curvy, but the bottom is for someone really straight. i don't know what they were using for a model, but this has to be tried on before purchased. the material is also rough, and there is no lining to protect you from that. i love my hd dresses for style and functionality, but this one is j", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "neutral"
            }, 
            "data": "The blue motif is a gorgeous indigo with an interesting pattern. a short tunic that drapes nicely and is flattering. very happy with this purchase. i plan to buy a 2nd for my mom to keep her cool and stylish.", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "negative", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "neutral"
            }, 
            "data": "This sweater is thicker and darker than it appears online. i thought it would be more of a blush color, but it's more dark gray and brown. it wasn't that flattering on me as a cardigan. looked a little cuter all buttoned up, but ultimately i am not keeping because of the color.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "neutral"
            }, 
            "data": "First, the good parts: these are adorable in person and (i think) the colors are prettier in person than in the pictures. the green isn't too army green, it's a pretty nice mellow neutral that you could wear with reds, whites, blues, pinks...virtually any color.\n \n the tencel fabric is super soft and comfortable and the drape is nice. they do seem to run a little large, so i'd size down if you're between sizes.\n \n and now, sadly, the bad: these stretch out virtually an entire size after just about a", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "This skirt is beautiful (especially the color) and looks well made. however, i am very pear shaped and this skirt is just too straight to be flattering on me. i agree that it runs small but even when i sized up it still wasn't flattering. i imagine that those who were not bestowed with massive hips will look lovely in this.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "positive"
            }, 
            "data": "I bought the dress that has the cream skirt with large flowers. i wore it for a wedding and was not only very comfortable with the pockets and the cotton top, i looked good. i got a lot of compliments on the outfit. people thought it was a shirt and blouse rather than a dress. i loved the high low skirt. the sizing was accurate and the dress is easy to clean.", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "neutral"
            }, 
            "data": "I love this sweater!! i like sweaters that are narrow on top and taper out so it doesn't look like a sack on me. plus, it is the perfect weight. i wish i would have bought one in a different color because it is so comfortable.", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "positive"
            }, 
            "data": "I like the idea of the pullover. the quality of is nice; the material is very soft and feels pleasant to the touch.\n \n i expected this sweater to be more flattering though. it is true to size, but the length is strange. it seems a bit too long, yet is too short to look like a longer tunic. or maybe the waistline is a little low... whatever it is, it makes me look like i have short legs.\n \n also, the collar won't stay down, the way it is shown in the picture. but it may work better for someone wi", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "neutral"
            }, 
            "data": "This top is soo pretty with a cool edge.\n it looks and feels like really good quality.", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "neutral"
            }, 
            "data": "This is a great casual summer dress. cute as a cover up but in the black you can definitely wear it for daytime. if you're feeling bare throw on a white button down or chambray.", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "neutral"
            }, 
            "data": "Beautiful colors, especially the pink. i am 5'3\" and about 124 lb. i got the small petite but am thinking of exchanging it for the regular xs. not only is it short hem-wise, which i don't really mind, but it is short in the waist. very pretty and good fabric.", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "Yikes! quite a smell off of this one- like wet/hot wool. the color was beautiful, but the sweater is enormous! strange fit under the arms as well. this one went back the same day.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "negative", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "Cute design with interesting details. i felt it ran a bit large. i'm 5'8\", 135 lbs, an 8 was too big and baggy. my biggest complaint with this skirt is the color. it's just not flattering.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "positive"
            }, 
            "data": "I happened upon this in my local store despite the fact that it is an online exclusive. i love finding returns so i can see them in person. i loved the soft colors right away. my hesitation was the standup collar but it actually folds down just fine and gives the vest lapels too. it also looks nice belted, left slightly open. i usually wear small or xs in tops and the small fits nicely. it doesn't need to close since there are no built-in fasteners. i will wear it with a long button down shirt o", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "The colors of this dress are beautiful and i really wanted to love it but it wasn't cut for my body shape. i think you either need to be curvy to fill out the chest or straight up & down to have it lay flat (as in the model). ordered size 6: 34b, 150 5' 9\", tall/slim build. i also think the high/low hem of the dress isn't well indicated in the pictures; i'm not a fan of the style and was hoping it would be minimal however the hem is definitely asymmetric.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "negative"
            }, 
            "data": "The shirt is absolutely cute looking. but that's just that....looks. i'm 5'2\" size 6 & wears m to l top. i tried on the medium in the store, it was rather flowing. i liked it. but i didn't like how it fit on the underarm area. it hung very low. so i ordered a petite m. still the same. plus the store the lighting was dark so i didn't realize how see through the shirt was too. had to return it.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "negative"
            }, 
            "data": "Nice, flowy, comfy top with soft fabric. there's a lot of fabric below the waist - it could probably work as a maternity top - but it drapes nicely rather than looking overwhelming. i do find that the buttons gap a little at the chest, despite the top fitting loosely on me, so i have to wear a layer under it.", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "negative"
            }, 
            "data": "I really love the look of this jumpsuit, casual but classy. shapely but comfortable. i'm 5'4 and, similar to another reviewer, proportional torso to leg ratio. the legs were longer on me than the model in the picture, but no problem there because they're cuffed.however the arm holes are too big. my bra shows, and the particular one i got came damaged with some of the embroidery coming unraveled on the back. it's also supposed to be dry cleaned and that's annoying for casual wear. returning it.", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "negative"
            }, 
            "data": "The top runs small, it is a very sexy and slimming top. i tried in l, it was too small so i have ordered it in xl. i hope it fits because it is very fitted and i am worried that the bottom will roll to the top with a fabric like this. but it is a very sexy, good looking, and slimming top. i love it!!", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "negative"
            }, 
            "data": "This top is really pretty and nice quality. runs big - i went down a size, and its perfect. coloring is more subtle in person than in the photo.", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "neutral"
            }, 
            "data": "I thought this would be a cute business attire skirt. i hate to say it, but i felt like it flared out as if i were amelia bedelia or some whacky children's book character and not retailer. the fabric made it look bulky. i sadly had to return it.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "I wanted to love these jeans, but as a woman who is almost 45 there was way too much stretch in them. i am always a size 26 and i couldn't wear these, they were way too tight! they went back the next day. i will say, it could be my body type, i\"m a runner so my legs are muscular. if you have very thin legs, these could be great and work for you. i loved the color, dark blue.", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "neutral"
            }, 
            "data": "Happy with this top- slightly thinner material than i was expecting but that'll be fine with our hot summers. got the navy striped one- very pretty and extremely soft. washes well. i do wear an tank underneath though becuase the armholes are slightly large and you can see part of my bra.", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "negative"
            }, 
            "data": "I have been wanting this sweater and decided to order. when i received it, there was no tag on the product. it was not in a typical clear bag from retailer and it wasn't packaged nicely. it came from reno, nv. most products i order do not get shipped from there. it is short, and i'm 5'1\". most clothes that are short fit me with no problem. this sweater might hit me at the waist, or maybe shorter. i think the color is nice and the sweater is soft but not what i wanted. i am going to return it", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "neutral"
            }, 
            "data": "The chevron pattern on the mint/seaside version needs to be centered in the front to look right. mine was totally off so i returned it and had them overnight me a new one to my vacation address. unfortunately, the 2nd suit i received was also \"off center\". that one is going back too. would have loved this otherwise! a quality check on this is definitely needed.... beware.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "positive"
            }, 
            "data": "I found this to fit true to size. i sometimes wear petite, but found the petite sizing to be a little off. i have a pretty short torso, but found the petite to be too short. i opted for the regular sizing and got a 6; it fits great. this top is great for work (styled with a cardigan or blazer) or for play. i can see it dressing up or down very easily.", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "I saw this dress in the store and loved everything about it. they had an extra large, i usually wear a large, and i thought it would perfect with some leggings. i tried to get the dress over my chest but no chance. my sister who wears a medium tried to put it in too and she couldn't fit it past her chest either. we flipped it inside out and couldn't find a zipper. maybe the dress in the store was mislabeled but the bust ran very small. it's too bad, it looked adorable and i was so excited to try", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "Adorable foxes, i was smitten in the store but the fix is bizarre and the foxes don't come up very high so you're limited in the length you can wear. i bought the m/l based on salesperson advice and i can't imagine trying anything smaller, i usually wear a size s or 4 bottom, these were super snug. back to the store they went.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "negative"
            }, 
            "data": "First of all, this skirt is as cute on as it is in the picture. very flattering. i am a curvy gal on the bottom and this is flattering. that being said, it runs small. i purchased a large which is my usual size, and i need another inch or two all over to make it work. part of the problem is the material. it is a very heavy, durable upholstery like material. there is absolutely no give to this. it is a very stiff material as well -- more what i would expect on a sofa than on my skirt.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "I wanted to love this dress. i ordered online and what you cannot see in the picture is the pleating on the dress. i ordered a medium, i am usually a large in retailer and the medium looked like a tent. i realize this should be loose fitting but it was huge.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "Again, bought this while wearing my retailer colored glasses. i loved the flowiness and color of the dark pink, and was convinced in the dressing room that this top made me look like a chic goddess, mid-vacation on the amalfi coast. i tried it on at home, and it straight up looked like i was wearing a maternity top. since i'm not with child, this one's going back!", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "neutral"
            }, 
            "data": "I would describe the color as more blush. the fabric does not have a sheen as in the model picture. the fit is much cuter on than hanging. i'm a 36c and the extra small is just a bit tight in the bust, otherwise i like the fit everywhere else. i'm going to order a small and see how it fits. at 5' 3\" it's also longer on me than on the model but not a deal breaker. looks kind of 1920's vintage on. my fabric is not see through it's more of a twill fabric but not quite as heavy as that.", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "positive"
            }, 
            "data": "This romper is cute, well-made and true to size, but i haven't figured it out how to put this on without having someone tie the back ties. which pretty much means that going to the bathroom is not an option while you have this romper on. not sure what the designers were thinking here. i'm returning this one.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "neutral"
            }, 
            "data": "So disappointing! everything i've owned from bordeaux has washed well and stood the test of time. one wash and this was ruined! shrunk terrible even after washing in cold water on delicate and laying flat to dry. completely ruined. returned it.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "I should have heeded the previous reviewer's advice. but i'm really short so i thought i'd give it a try. there is something really wrong with the bust. first, it's about 3-4 inches higher than it should be. the bottom trim cut across the middle of my bust. even if i hoisted everthing up in there to fit the cups, they are really only designed to fit cones, not curves. from the side it looked hideous. too bad, because the fabric and fit everywhere else is gorgeous.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "negative"
            }, 
            "data": "I ordered the blue in size 16. it ran at least two, if not three, sizes too small compared to my other retailer 14 & 16 blouses. it was too small through the body, other than the peplum. the arms were tight too. the waistline and length matched the online photos. it's widening. the material they chose was also scratchy and rough, especially around the neckline. i returned mine after trying it on and seeing there was no way to make this work. the blue color was gorgeous though. the patterned lace w", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "Such a cute skirt- but impossible to get on. ordered in an xs (i have a 25/26 waist) but could barely get it past my knees to step into. if you have any hips at all, unfortunately this skirt won't work. i was tempted to size up but once i got it on it fit great in the waist and already had too much material to size up to a small.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "negative"
            }, 
            "data": "Beautiful fabric with soft drape. unfortunately the \"captain kangaroo\" pockets are awful. unless you have a straight up and down shape with no hips this is very unflattering. the pockets look like saddle bags and add a huge amount of fabric where most people don't want added bulk. very disappointing. returned.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "neutral"
            }, 
            "data": "I tried this on from the sale section, and they only had a 2 (i usually do 0), and surprisingly, that size was the right fit. it is fitted, with just enough room to eat :-) \n the blue is a light blue, almost neutral, with the white embroidery, i think it looked stylish, and decided to keep it. the peplum part hit just in the right spot, i am short (petite) but my torso is normal size...", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "negative"
            }, 
            "data": "I love the layered look of this jacket. i got it in navy which matches everything. i think it's a little on the large side for me. i ordered a small. i'm 5'2\" 130 lbs. super comfortable. the inner layer is very soft. once you wash it, the outside is soft too. i've already worn mine several times. happy.", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "negative"
            }, 
            "data": "Very nice fabric but disappointed in the stitching on the knees. it looks nice but makes the pants very uncomfortable and tight around the knees. too bad because i love the style and hoped they would work!", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "neutral"
            }, 
            "data": "Oh elevenses, i love your pants..the fabrics, the details, the length. i've found elevenses to be classic work pants. reliable, professional, well made. these are none of those things. the cardinal trousers are thin and the rise feels much higher that's it appears in the picture. the red pair are thin, stretchy and cheap. both pairs have to go back. i'm truly sad.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "neutral"
            }, 
            "data": "Gorgeous fun dress, but the cut in the armholes (6 petite) is really low. so low even a strapless bra peeks above it. there are also lining issues (could have been with just my one choice) where the lining is not stitched well around the armholes so it shows too much. back is stunning. i would say that if you can go bra less this could be so awesome. it didn't work for my body because i have to wear a bra, but i think its a winner for someone.", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "negative", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "neutral"
            }, 
            "data": "When i received this blouse, i noticed that there were gold dots all over the blouse and they were very sticky. some of the fabric would stick to these dots. i thought it was because the weather was sticky and humid. however, after hanging on my closet door, the dots are still sticky. i do love the design and fabric so i will try not to let the sticky dots bother me.", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "neutral"
            }, 
            "data": "I loved this romper so much! the material is thin, but perfect for summer. the style is just what i was looking for. it's so so cute and fit perfectly...at first. i wore it one time and then washed it exactly as described on the tag and it shrunk beyond recognition. it went from loose and flowy, like on the model, to little booty shorts and a body suit...not the look i was going for. i am so disappointed.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "negative"
            }, 
            "data": "Love the fabric of this shirt even though it was thinner than i expected. it is soft to the skin and flattering. however i returned it because it is made for women with long torso and shorter shoulders.", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "neutral"
            }, 
            "data": "This dress looks lovely on the model, but it looks just awful on me!\n i am 5'4\" and curvy. the shoulders are cut with a weird shape. instead of a cap sleeve, it is like a pointy cap on the side and stuck out on my shoulders. it looks like i am ready to get beamed into space.\n the material is nice and the sequins are pretty, but the cut of the dress is unflattering.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "negative"
            }, 
            "data": "I'm a 32-a, and i bought a small. i found that the tube portion is pretty tight, but probably needed to keep things up. because there is not a clasp in the front or back, it is really hard to get in and out of. i'd probably be ok with it, but the cups were too big for me. i think i would need to be a c to fill it.\n the quality is really nice and the molded cups are a good shape. i wish i could have made it work, because it was really comfortable. i returned it in the end.", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "positive", 
                "Fabric": "neutral", 
                "Fit": "neutral"
            }, 
            "data": "Very nice casual, inexpensive shirt and the laced neckline is great....not too revealing and easily worn tied \n without looking prudish. and of course, open as well", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "negative", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "neutral"
            }, 
            "data": "Purchased this top online, and when i received it was very pleased.\n it has and elegant cut and yet is a casual fabric.\n love that the sleeves run longer......ads to the overall look.\n also loved the v neckline.........enhances the feel of the overall style.\n with various necklaces this top has limitless options!\n the color states moss....which i usually think of as greenish brown......i found it to be more of a taupe.\n would have liked it to have a green tones, however it is still a fantastic f", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "positive"
            }, 
            "data": "I really wanted to love this shirt. the fit was great, and the fabric just felt beautiful. luxurious, soft and flowing. but the collar was frayed... in addition, the little keyhole area fabric also had to be carefully handled to make it look smooth and not like bad workmanship. i put it aside to return it, then this morning went to have another look at it, wanting to talk myself back into it. but i can't overlook the fact i'd be ordering a new shirt that would look time-worn. it may be only this", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "Oh, i wanted this dress to work! i bought it in green, red and the solid blue. all ran really small. i *just* fit in a 10, when i would normally take a 6 in retailer sizes (5'8\" and 140 lbs). as with many other reviewers, i also noticed that the zipper was a huge flaw. it took a long, slow motion to get it zipped because it would get stuck on the fabric variations. such a cute style, was really bummed it didn't work. i kept ordering it in other colors thinking i would hit the jackpot, but they wer", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "negative"
            }, 
            "data": "I ordered a size small. i am 5'7\" size 6 and the dress was a mini on me! way shorter than on the taller model. the stomach and hips gaped out from my body yet the waist was cut way too high, so the dress was both too small and too big! very odd fit. the material is soft, thick, stretchy and has a textured pattern which i liked. this one is going back.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "I love the metallic colors of this top and figured i could wear it under a ruched jacket and circle skirt for work. welp, that's out the window. this design is poor. for one, this is not a piece for a petite woman with no torso and i don't know how anyone with a longer torso wears this. this hits above my belly botton on and i got a petite 2. i have no torso. so, without a jacket, i would never wear this. it's very low cut..the back is very low..it's a little loose but i run between a 2 and a 4.", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "positive"
            }, 
            "data": "I want to live in this sweatshirt. it's so comfy, but also well-cut and lays nicely, not boxy at all. i'm typically a 10-12 or l in tops and the 3 is roomy without looking sloppy.", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "negative"
            }, 
            "data": "I love byron lars. very taken with his fabrics and design concepts and i have ordered several of his dresses but i believe i need to surrender to the fact that they do not work for my body type. the dress is gorgeous in person: all the fabrics are great, the dress is fully lined and lots of nice finishing touches. it is a unique and very striking dress; this one i really wanted. however, it is designed for a woman who is proportionally longer, leaner with a larger bust size than i have. i ordere", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "Ordered this in white. it is really nice and sexy but very body hugging and unforgiving. perhaps it is my large stomach, but it hugs a bit too much for my liking. yet i think overall the design is very nice so i am keeping it and hoping i can lose some weight in my tum.", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "I really wanted to love this dress, but it was so short! i'm only 5'6\" so i don't consider myself really tall, but the dress only came a couple of inches lower than my butt! way too short for me. my husband asked if it was a shirt or dress haha. but i think this would look adorable on someone a few inches shorter. or someone younger who can pull of a short shirt :)", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "negative"
            }, 
            "data": "Okay, i love the blouse this brand has in the same material, so i thought i'd delight in this dress. i am a 5'7\" hourglass but have a longer torso. i ordered the large in this, usually a 10 or 12 fits me.. but the waist hit much higher than my natural waist, and yet it was somewhat tight and completely rigid. the bust area was a little loose, and i'm a 36c. then the bottom flared out in sort of a flower fairy poof above my knees which reminded me of a navy blue oompa loompa dress.. and i love my", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "negative", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "positive"
            }, 
            "data": "I am returning. i really liked the appearance in the photo and i love aqua, but the biggest problem for me is the shape. it's pretty boxy and it's hard to tell from the photo, but it has a batwing shape. i also wish the lighter portion were more ivory (less yellow in it), but that's based on what looks better against my skin tone. i found it to run true to size, but i thought it was unflattering (made me look wide).", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "positive"
            }, 
            "data": "The fabric and its texture didn't meet my expectations unfortunately. there were too much fray and cast-off of edge yarns of a fabric... \n however this will fit if you wear over the swimming wears.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "This coat is beautiful! i love the color and the design. it definitely runs a little large. i usually wear a small or a zero and i can wear a small wth a large sweater underneath no problem. i might have wanted an extra small but i just stuck with the small because i needed the coat already. the vest keeps it warm, but the sleeves aren't lined so it's cold unless you have a nice sweater underneath it if you're going to be in cold weather.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "negative"
            }, 
            "data": "I ordered these in my usual size and could barely get them on. they fit like tight leggings. they have spandex that is comfortable and they will probably stretch as you wear them. i exchanged for the next size up, because the style is great for year -round and the quality excellent. i live 2 hours from a store, i would either order up at least one size or try them on in store.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "negative"
            }, 
            "data": "I would have loved this dress if the bust and waist were just a little more fitted. i am 32c and the top was too big. fit perfectly on hips. the lace material means it cannot be easily altered, so i chose to return the dress. i would have definitely kept it if it were a better fit.", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "neutral"
            }, 
            "data": "I purchased this item in the gray heather color and loved it so much i wanted to buy every other color. the fabric was cottony and felt very soft and cushy against my skin, and the gray color was from the combination of black and white fibers. i ordered the light gray and the red online and could not wait for them to arrive. but the other colors were not even in the same material, but a very shiny and synthetic feeling fabric, with just a single color weave that did not have the same feel or tex", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "neutral"
            }, 
            "data": "I love this top. i wear it all the time. the problem is that you can tell i wear it all the time as the fabric has started to fade. i'd still recommend it as it is so comfortable.", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "neutral"
            }, 
            "data": "I went ahead and ordered a size up based on previous reviews, but i should have ordered my own size, as they're a bit loose around the waist. the pants are adorable and the pinstripes very flattering, so i definitely recommend them!", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "neutral"
            }, 
            "data": "I love, love, love this absolutely stunning dress. the only problem was that the zipper was very difficult to maneuver, and when it finally went up, the watch it was attached the lining of the dress made a bump in the dress, which was very unflattering on an otherwise very flattering dress. i tried on multiple versions of this dress and had the same design issue with each. i ended up returning it because it bothered me so much.", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "negative", 
                "Fabric": "neutral", 
                "Fit": "positive"
            }, 
            "data": "This dress first caught my eye online. due to the price i resisted. then i saw in store and tried on...i decided to hold off for a sale, but my will was getting thin. once i saw it start to sell out online, i had to take the plunge. i knew this dress was a must have. it is super flattering and comfy! the best of both worlds. i'm small-chested so both the s and m fit, but the seam on the s fit a bit higher, which was more flattering on me, so s is what i got. it can be dressed up or slightly down", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "positive"
            }, 
            "data": "This tank fit well and i loved the ruffle in the back and how it layered. but the front was not a good look and i will be retuning it.", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "neutral"
            }, 
            "data": "This sweater is perfect for fall...it's roomy, warm, super comfy and the color really pops.", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "This sweater was a big let down. i am 5'2\" so i ordered it in a petite. it was so short that if i lifted my arms, you'd see my bra!! there is no way i could wear it without something under it- even with high waisted bottoms. and the bell sleeves look nothing like the pic. the entire sleeve is just wide, and it continues with little increase into the cuff. it is just short and boxy. it is going back for sure.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "positive"
            }, 
            "data": "I love the fit of these pants -- they're the perfect slim black pants. however, i wore these pants exactly three times before the seams split the middle of the pant in not just one, but multiple places. disappointed by the workmanship/quality of the product, especially since the pants fit amazingly and don't sag like other slim fitting black pants tend to do. i hope retailer will take this into consideration and improve the quality of future iterations of this product.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "The dress is too loose and runs too big", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "positive"
            }, 
            "data": "I am on the fence about this dress, as you'll see the reasons below, but it is really breathable fabric and extremely comfortable!\n _________\n pros:\n - tons of stretch to the top part. i'm a 36c, so a lot of retailer tops are too snug for women with some bust. however, i fit into a medium here without it being too snug. you could actually go down or up depending on how loose or tight you'd like it to be on you.\n - the bottom half, the skirt, feels so nice on the skin. very breezy. it is layered an", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "negative"
            }, 
            "data": "The stylist had me try this top on off the shoulders, but that was kind of snug, perhaps why it didn't fit right, it is not off the shoulders on this picture. the cut is loose, so it looked big on me, but going smaller would not have worked the way i had it on... may give it another try on. xs was big, so would need to try the xxs next time. but off the shoulders looked nice on the lady who was smaller built next to me!\n \n colors are nice, light, but appropriate for fall (or summer!) light fabric", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "negative"
            }, 
            "data": "These pants are so soft and so comfortable! i was absolutely in love at first sight. however, i got the petite, because i am 5'3, and they were still a little longer than i like my pants to be. i wanted them to hit right above the ankle, just like the photo, however, they are a tad longer. i still love them and they are still as comfy as ever, so i am gonna deal with the length!!", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "negative"
            }, 
            "data": "I'm assuming the model showing the sweater is at least 5'9\", it is slightly cropped on her , but it certainly doesn't look super cropped. i'm 5'4\" and its super cropped on me. even with high waist jeans.\n also, it is incredibly itchy. i even tried it with a cami under but the itchy wool came right through the cami.\n too bad, its a cute design, just needs some tweaking.", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "negative"
            }, 
            "data": "This dress had so much potential. the top was absolutely gorgeous. my issue was with the bottom half of the dress. the bottom is made from a heavy quilted material that is stiff and has no movement at all. the dress is supposed to fit like a modified mermaid dress where its more fitted around the hips and flares out, the dress i received had so much material on the bottom that it actually made my hips look bigger. i though about having the dress altered but decided to return instead.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "neutral"
            }, 
            "data": "I wore this bodysuit once. it had a hole under the arm when i took it off", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "neutral"
            }, 
            "data": "I waited three months for these pants. when they finally arrived, i was mostly pleased. they seemed like the staple pant everyone is raving about. and they should have been.\n problem one: they bag out. i got one wear out of them before i needed to wash and hang to dry (regained shape then).\n problem two: the crotch split! in the front! i'm a teacher. i sincerely hope no one noticed! i read other reviews about this problem and don't know if i got a bad batch or if a similar fate is awaiting other", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "neutral"
            }, 
            "data": "I loved this blouse when i got it and wore it before washing. it fit really well and was flattering. the only time i laundered it i hand- washed it in cold water and hung it to dry. the blouse shrunk at least a full size and in awkward places. the sleeves are now tight and way too short. the overall length shortened by at least 2 inches. the top is so tight in the bust now that the buttons popped open. i'm very disappointed and surprised.i will be returning it as it is unwearable as is.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "neutral"
            }, 
            "data": "Beautiful dress with the colors and pleats. i did not have the same problems with the bust area that others did. my biggest complaint is the exposed zipper doesn't lay flat, even when just hanging on the hanger. when actually on a person the zipper juts out. had to be returned!", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "neutral"
            }, 
            "data": "Nice fabric and cute design. a little low cut.", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "This runs really large. i love it! sold out of xs p and xxs p... go figure :( size down if you are slim.", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "I expected the waist to be cinched like it appears on the model but it isn't. i ordered the xs and i'm swimming in it (i'm 5'4\" and 120 lb). would suggest ordering a few sizes down to avoid looking like you're wrapped in grandma's table runner.", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "negative", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "I agree with the previous reviewer that the length is not at all what is shown in the picture. much shorter than that. and while the overall detail of the skirt is very nice, the elastic waistband makes it look cheap considering the price...", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "Wanted to like this top but it looks terrible and does not lay right. the bust line is not tight enough to contrast the rest of the top being flowy. does not give any shape to the body. do not recommend for anyone with a medium to large chest.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "Looks great on the model, but in actuality there is way too much fabric; what should be flowy and billowy looks like a tent (or a maternity top on a petite woman). it didn't matter which size, they all fit me disastrously. i love the look and i thought of keeping it and having it taken in, but there's too much fabric under the chest to make it an easy cut/alteration on the side seams. sometimes i wonder who comes up with these patterns, and if they pin the shirts back on the models.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "negative"
            }, 
            "data": "Dress ran very large in every way. beautiful design, lining and quality material. i should have sized down 2 sizes. item is now sold out.", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "negative", 
                "Fabric": "negative", 
                "Fit": "neutral"
            }, 
            "data": "These look much cuter in the picture than in person. i found them to be very thin and cheap looking. i am pretty sure you could find a similar pair at a budget department store.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "neutral"
            }, 
            "data": "I am 5'8 154 pounds and ordered a medium. the coat is a bit bigger than expected and should have gone down a size. i'm keeping this size however because it is incredibly comfortable, roomy and perfect for mild winters. the wool does keep you warm in 50 degree weather.", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "positive"
            }, 
            "data": "This top is absolutely stunning. i purchased the white one. just received and it fits nicely-a little on the big side but i believe it looks better that way. this will look great with everything. it is well constructed and looks very unique. love it!", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "negative", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "neutral"
            }, 
            "data": "I'm very pale, and on me the rose color looked really washed out. the catalog photo is not an accurate representation. look at the product shot for a truer representation. it's slightly see-through and was too close to the color of my skin. i think it would look delicious on someone who has darker skin, though.", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "negative"
            }, 
            "data": "I purchased this top in a regular small and surprisingly, it fits me very well (i'm 5'2\", 34b, 26 waist, 36 hips). the hem falls about two inches longer than shown on the model. i like the v-neck the most because the ruffles are not too much, and it's not too low cut. i purchased the white color because i think the pattern is unique and it's brighter for spring/summer. i think skinny jeans and ankle boots or wedges would make the look very stylish. by the way, the fabric is super soft (but not w", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "neutral"
            }, 
            "data": "I really love the front of this shirt. however, the back of the shirt is more of a jersey material so it doesn't seem to match the front of the shirt. i still wear it and it looks cute, but it threw me off a bit at first.", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "positive"
            }, 
            "data": "This top looks pretty much like it does not the model. the sleeves are a nice length and are not too tight. the fabric is light weight, but not see-through. it does not wrinkle a lot. i've gotten several compliments on it and it goes with lots of different bottoms and will work under jackets too. the v-neck is pretty deep, but doesn't show so much cleavage that you couldn't wear it to work.", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "neutral"
            }, 
            "data": "Love, love, love this dress. it is very slimming. it hugs you without really touching you. leaving the tie and a few buttons open gives it more of a casual feel.", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "neutral"
            }, 
            "data": "Gorgeous in every way except its length and how it hangs at the bottom. i prefer a shirt i can wear tucked in or out. this one will work well tucked in but not out so i am returning disappointed it was so well done in other particulars.", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "I bought this top thinking i would wear this and feel like i was part of some fashion week, but it's cut way too large that i felt like a football player. this top is made for women with small shoulders and a super petite frame. also, the cut is way too big. i was swimming in this.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "neutral"
            }, 
            "data": "I have a short torso and this works well for me. 34c, bought the 0. there's not much stretch to the fabric so it is fitted to my chest, but not in an uncomfortable way. definitely doesn't hang and have extra fabric like on the model. \n \n zipper goes almost all the way down to the bottom so it's easier to get on and off which makes up for the lack of stretch n the fabric.\n \n unlike another reviewer, i found it went really well with navy pants and i wore it to a business meeting under a blazer. wi", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "negative"
            }, 
            "data": "I tried this on the other day at the local store in a size xs/s. although it's wool i didn't notice that is was itchy & usually wool bothers me. i am of small build but i did like the long & oversized look. i admit i am drawn to the print anyways. i noticed the right armhole was larger than the left so i tried on another xs/s - it was the same. probably the armholes will be smaller in the petite sizes. i decided to make other purchases but will order the petite xs/s in a few weeks since the invent", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "positive"
            }, 
            "data": "love these jeans! they felt so comfy the first time i put them on. it's like butter! i'm a 26 but went down a size and wear a belt. they said they r high rise but i can't see how - but no complaints as i can breathe in them :)", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "True to size on the neckline and arms but extremely large and puffy in the torso. very unflattering cut!", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "negative"
            }, 
            "data": "Wanted to love this sweater for its beautiful colors and cute graphic, but the fit is uncomfortably small and it is so itchy i was yelling, \"get it off\" in the fitting room. bummer.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "positive"
            }, 
            "data": "Took a chance on this blouse and so glad i did. i wasn't crazy about how the blouse is photographed on the model. i paired it with white pants and it worked perfectly. crisp and clean is how i would describe it. launders well. fits great. drape is perfect. wear tucked in or out - can't go wrong.", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "negative"
            }, 
            "data": "The fabric is beautiful, even the lining is lovely. i ordered the green color in a large, as i'm curvy and have long arms. but it just doesn't lay correctly at all - the collar has no structure, even though it's a lapel, and the side vents just pop out - the jacket added about 10lbs, and just looked frumpy. it looks much more tailored on the model. too bad, as i have been looking for a velvet blazer in the color for a long time.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "negative"
            }, 
            "data": "Tried on this maxi dress recently, hoping i would have a new dress to enjoy but the frabic is just too thin. so sad :(. unfortunately it shows every lump and bump and even wearing spanx while trying on it still showed too much. a full length slip would help but i decided to put it back.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "neutral"
            }, 
            "data": "It's hard enough for women to find clothing that will make them look as beautiful as they feel but add a bigger bust size (i'm a 36dd) and it makes it this much harder. i ordered this top because of how beautiful it looked on the model and the price. when it arrived i was so excited! retailer does such a beautiful job with the way they handle their items! it was wrapped beautiful and no damage. i ordered a size 8 knowing that my chest could be a potential problem. the too itself is gorgeous! i did", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "negative"
            }, 
            "data": "Very pretty fabric and beautiful color, but i agree with the other reviewer here, the fit is a bit strange. the waist is very small - need to size up at least one size for that to fit - while the rest fits nicely. it's also a little longer than i had expected...sort of looks like it should be a couple inches shorter (and i'm 5'11\"!).", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "neutral"
            }, 
            "data": "My usual size 6 fits perfectly... yes the metallic fibers on the inside are scratchy. a cami solves that problem. when ordering, i realized i could not go strapless & would have to wear a one of my wider strap cami's in navy or black to cover the bra strap area. it was obvious some sort of cover-up sweater or jacket would be needed & would cover the strap area anyway. so, i also ordered the 'faux-fur cardi' in the ivory to wear over this top. it's a shrug-like cardi with 3/4 sleeves. comes in the plum also if you", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "neutral"
            }, 
            "data": "I purchased this top in blue and liked it so i ordered the red color. i hated the way the second one fit. i'm concerned the blue will not wear well after seeing the way the second one looked!", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "negative"
            }, 
            "data": "This top is just as beautiful in person as online. however, it has two issues for me. 1. it is too short. this might work if you have a short torso, but it would forever show my stomach. 2. the fabric has way too much static cling. no matter what i tried, it just clung to my stomach and flared out at the sides. not attractive. in short, if you have a short torso and don't mind battling the static, this truly is a beautiful top.", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "positive"
            }, 
            "data": "Agree with other contributer - this is a great piece to snag on sale. i bought this 2 months post partum with the intention of hiding the post baby belly - which is does well! i think it fits true to size (i'm typically l and this l fit well). i can see how certain body types it would look maternity, but i'm short and curvy and the blouse is flattering. it's lightweight, so i plan to add a cardigan in the fall/winter.", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "neutral"
            }, 
            "data": "I love this tee but there is a lot of swing/ fabric so it can tend to make you look wide. also, i have a short torso to begin with but this tee is on the short side. i'm still undecided on whether i'm going to keep it because it's rayon/ poly and it's hand wash only. and i'm worried that one wash will make it shrink in length and it's already short. rayon knits have a tendency to shrink in length when washed so beware!", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "I wanted this tank to work so badly! it was a great deal and so beautiful. unfortunately the top fitted portion ends right below my chest then the shirt flares out so i looked like a cupcake. my belly also showed slightly because the shirt is short. if you have a short torso, this would work great. if not, unfortunately, its not great - tear", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "negative"
            }, 
            "data": "I got the blue. it is very short. one side of the shirt i received was shorter that the other. the material feels cheap and pleats out a bit right over the bust - only flattering on small busted models.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "positive"
            }, 
            "data": "I saw this top online and read the reviews so i passed when i went into the store. when i went in again i thought i would give it a try. so glad i did ! it fits great and is way way prettier in person ! i ended up buying it and so glad i did !", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "positive"
            }, 
            "data": "Bought this on a whim and it exceeded my expectations. i didn't know what to expect with the quality of the fabric but this is incredibly soft and warm. haven't worn it outside yet but i can see this already as one of my favorite items. i'm usually an extra-small but the xxs also fits. it's a great buy especially since it's on sale now.", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "neutral"
            }, 
            "data": "Great swimsuit, love the fabric and pattern. the top lacks support.", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "I passed up this dress so many times in the store and finally tried it on today because i wanted a casual dress while traveling in the cape. i was surprised how much cuter it is on than on hanger. i sized down to get a more fitting look and really made a difference for me in style. i was not a fan of the way it looked so loose on model. it looks really cute fitted and a bit sexy even. it is lined and very comfy and can be dressed up a but for work with a cardi. i believe i will get a lot of wear", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "I absolutely love mother jeans, but i unfortunately had to return these ones. this particular style seemed to run pretty small. too, i always size up in white jeans, and even the size up that i had ordered were just too tight. i typically wear a 28 in mother, and ordered a 29 in these.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "negative", 
                "Fabric": "negative", 
                "Fit": "neutral"
            }, 
            "data": "I was so excited to get this dress. i need it for a wedding, and i thought i had hit the jackpot. the dress arrived with a small tear. the seams are puckered and badly seen. for an almost $300.00 dress, the quality is terrible. i expect better from retailer. i'm so disappointed.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "negative", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "neutral"
            }, 
            "data": "So you're thinking this is a red and black skirt right? nope. it's an obnoxious cherry red netting with cranberry crushed velvet insets overlaid on bright red actual spandex. spandex that shows every wrinkle and panty line. it's really god awful.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "neutral"
            }, 
            "data": "This is a great silhouette and the red/black plaid will be perfect for fall. it will look great with black bottoms or with jeans. the only reason i gave it 4 instead of 5 stars is that the outer shell fabric (the plaid) is a rayon twill that is a little bit lightweight for the silhouette, so it is bagging out a little around the zipper and the pockets. i'm hoping the quality will hold up. i bought this same jacket in a heavier weight camoflage printed tencel this spring from the same brand, and", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "negative"
            }, 
            "data": "I am 5 6' and 130 pounds and ordered this in an xs. the sweater is enormous. the material is also scratchy and not soft at all. i'm disappointed with retailer's sizing this year. i've had to return a number of xs items because they are huge. really disappointing.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "I loved this top online but it arrived very wrinkled which raised a red flag as to how it would look after wearing it. seemed high maintenance. also, didn't love the fit. color is vibrant but overall not a fan of this top.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "neutral"
            }, 
            "data": "I tried this dress on in store. i loved it online, but in person....not so much. it looked and felt like a cheap halloween costume. the fabric was bad. really bad.. the mustard color was beautiful.... boo", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "negative"
            }, 
            "data": "This bra is extremely comfortable and surprisingly supportive considering the lack of padding or firm material. it also runs large.", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "negative"
            }, 
            "data": "I am always on the hunt for a cute white t-shirt but this one was a miss. it is too boxy (short) and the material is very thin for the price. i gave it two stars because it has nice colors for spring/summer. for reference, i am 5'4 and 115 lbs and i ordered a small. bought it online so i ended up returning it to the store.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "I bought these on sale and they quickly went back. i was very disappointed after reading the reviews. i thought for sure these would be a winner. however, i was sadly mistaken. i ordered another pair of jeans, the same, from a different brand. these were way too small while my others were too large. they didn't live up to my expectation and were still rather long. even though i bought these on sale, i was not happy with the quality.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "negative"
            }, 
            "data": "I ordered a small and it is enormous; i usually wear a size 10. it is short but the fullness in the body and the sleeves made me look like a sumo wrestler. also, it is a very heavy knit which would be great for up north but too bulky for atlanta unless the temps are in the 40s. i'm sending it back.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "This dress looked super cute in the picture and on the model. i ordered the petite style and it was still so big and way too loose. no shape whatsoever! i unfortunately had to return it. i love loose dresses but this one was way too big, loose and had no shape at all.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "The colors and print are absolutely beautiful and i'm quite heartbroken that this suit just doesn't fit. i don't have a long torso but the v was just so plunging that i wouldn't feel comfortable leaving the backyard lounge chair in this bathing suit. no matter how much i tied the halter it still revealed a v halfway down to my naval. the strange thing is that there seemed to be too much fabric on top, lots of ruching and thicker straps than i would normally go for, and while i'm only around a b", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "I loved the star pattern of this top but the cut was odd. it is very big in the chest and full at the bottom. for anyone who is petite on top it tends to look sloppy.", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "neutral"
            }, 
            "data": "5'1'' 43-31-43. i really wanted to love this coat: the material is nice, the green color is dark and rich, it has a hood. however, the cut is bad for me (and probably a lot of other people). the shoulders were cut too wide and impeded movement, and the bust and hips were cut too tight, overall it was just boxy. i have another boiled wool coat that i bought at retailer about 7 years ago and though it's cut oversize like this one, it has a much fuller sweep, so the proportions still seem right. also", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "negative", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "neutral"
            }, 
            "data": "This cardi is cuter in the stock photos. in person, the colors are a bit more drab. stock photos also don't show quite how much of a swing shape this has. it is very soft, though. returned it!", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "positive"
            }, 
            "data": "This is, like many reviewers stated, a very flattering and nice dress. the sleeves were particularly great, because they are slightly longer than most of this type and went past the meaty (for lack of a better word!) part of my arm, only exposing the slimmer bits. it looked great on me, and i imagine it would on most people. i just did not like the handkerchief hem....too young, too trendy? i don't know, when you're in your 40s, you start to feel ridiculous in certain styles! i just didn't feel", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "positive", 
                "Fabric": "neutral", 
                "Fit": "neutral"
            }, 
            "data": "Cute white t-shirt different style but didn't work on my body type so i returned it \n  good price point \n  basic fabric", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "This top looked super cute online but when it came it was super short and boxy. looked like a tent on me. this one went back the same day it came!", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "neutral"
            }, 
            "data": "The dress is cute, but i'm somewhat concerned that it will be sheer in the sunlight. i guess we'll have to wait and see!", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "I find that this brand can be a little bit all-over-the-place with sizes. had i tried this on in person i may have bought it in a small instead of a m. despite being a bit big it still looks great and hides my flaws well. i bought a m in another shirt from them (the seamed scoop neck) and that shirt was a full 2 inches smaller in the bust than this. just something to keep in mind. still a great shirt, love the neutral color.", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "negative", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "Got the black but the orange it very pretty too the black fabric has a sheen to it; almost like snakeskin. as other reviewers have mentioned, it does run small and the armholes are cut in a bit. overall it is a more interesting than a basic little black dress.", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "neutral"
            }, 
            "data": "It looks like you are wearing cargo shorts. really unflattering. avoid buying this skirt", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "neutral"
            }, 
            "data": "Wish i would have read the reviews before i purchased and wore two of these. washed as directed and same outcome as everyone else. basically unwearable unless i maybe use it for a nightshirt. the shrinkage lengthwise was ridiculous. glad i didn't buy every color like i had planned to do!", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "negative", 
                "Fabric": "negative", 
                "Fit": "neutral"
            }, 
            "data": "I don't normally review my purchases, but i was so amazed at how poorly this dress was made, i couldn't help myself but to post a review. the neck line isn't even hemmed down so it flaps up. the material is thin and feel cheap. this dress isnt even worth $20 in my opinion. i was expecting a well made, good quality dress for the high price tag.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "neutral"
            }, 
            "data": "I recently got this on sale after looking at it forever on my wish list. i'm so happy with it. its very comfortable and just long enough for my torso (5'3). the pattern on the front is very flattering.", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "neutral"
            }, 
            "data": "I really wanted to like this dress, but where the skirt meets the top of the dress in the back creates sort of a hunchback effect in the back. will be returning.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "negative", 
                "Fabric": "negative", 
                "Fit": "neutral"
            }, 
            "data": "I tried this jacket on and it was definitely cute but a couple things to note. it's a wool acrylic blend and it was already starting to pill from being tried on in the store. also, it's unlined. i thought the price point was high given its fibers and unlined. given its hem, i wonder how much longevity the piece has and how quickly it might start to look dated too.", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "positive"
            }, 
            "data": "I had to order this blouse since it is named after the town i live in. it does not disappoint. the flowers are so pretty and it has great style. there is a little piece in the neckline so it is not too revealing. the sleeves are loose and cover the bra strap underneath. the back has a little bit of elastic so it does not look like a maternity shirt and it gives you some shape. i can't wait for it to warm up and to wear this!", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "negative", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "neutral"
            }, 
            "data": "The fabric was nothing special (i usually like a cotton/silk blend woven fabric, but this was stiff feeling) and the pattern was cute. but what made me return it was the fact that 1) the rose gold glitter dots are puffy paint. literally. puffy. paint. and 2) the dots were not quite dry on my top when it arrived. parts of the paint came off on my fingers and the top was stuck to itself because of it. i could barely unfold it.\n \n i'm sure this could have been cute, but who wants a top that looks like", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "neutral"
            }, 
            "data": "3 tags sewn in, 2 small (about 1'' long) and 1 huge (about 2'' x 3''). very itchy so i cut them out. then the thread left behind was plasticy and even more itchy! how can you make an intimates item with such itchy tags? not comfortable at all! also - i love bralettes and wear them all the time including to work. i am a b cup. however, this one is so thin and flimsy that it gives no support even to a b cup - so for me this would only be a lounging bralette - if it wasn't so itchy!", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "neutral"
            }, 
            "data": "This dress is so comfortable, and i love the unique faux leather skirt and lace design. it really adds a special touch to the dress. i only gave it four stars because the top half is pretty boring...i wish the neckline wasn't so matronly. i'll definitely need a bib necklace or scarf to dress it up. i'm 5'5\" and 115 and ordered the xs. i wish the dress cut in a little more at the sides to accentuate an hourglass figure, also. my husband loved it.", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "It was very pretty,but it ran very big , sadly i had to return it.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "Great looking jacket with attitude. the color is more like a faded black or deep charcoal grey. i'm usually a large petite but this is snug in the chest. luckily it's a knit so i can make it work by zipping it partway and leaving the top half open.", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "negative", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "I've been eyeing this top up in the floral pattern for a while and finally ordered it when i had 15% off. i really don't think it's worth the price and it's not very flattering. i think it would look better on someone less busty - it seemed to accent my bust. it's definitely not my favorite piece and unfortunately i will be returning.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "neutral"
            }, 
            "data": "I had hopes for this shirt but was disappointed in the fabric...it's very stiff and heavy for a summer blouse. will be returning it.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "negative", 
                "Fabric": "negative", 
                "Fit": "positive"
            }, 
            "data": "I ordered this top in size xl. there is a lot of excess material below the empire waist so it flows out too much. this accentuated my pear-shape and was unflattering. the sizing on the top portion & sleeves was true-to-size. \n \n the material is so rough, scratchy & uncomfortable. they should have used a softer fabric. the pattern alignment is terrible on the one i received. at $100, i hoped the plaid would have flowed in a continuous, matching line. i didn't notice the mismatched sleeves of the", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "neutral"
            }, 
            "data": "Ladies this top shrinks!!! i am very disappointed, i was in love with this top and the first time i washed it it shrunk a significant amount. i did not use a dryer, i laid this piece out to dry as i do with the majority of my knit tops and it shrunk. it is a lot shorter and much tighter, especially in my arms. if you love this top i might suggest buying a size up and washing it to fit.", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "negative"
            }, 
            "data": "I love this top. it is loose and comfortable. it is not sheer so you don't need a cami. it runs a little large so size down if you want a more tailored fit. 1 criticism, it catches on sharp jewelry or belts and can pull if you are not careful.", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "This is a very pretty shirt which is too narrow across the back. i need to be able to move my arms freely at work, so this did not work for me. you may be able to size up for a better fit if moving your arms is important to you.", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "neutral"
            }, 
            "data": "I loved the look of this sweater, but the workmanship was surprisingly poor. there were missed stitches, and loose threads throughout, and even a tag sewn to the outside. retailer was great about the return. i really wanted to keep it and was very disappointed.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "positive", 
                "Fit": "neutral"
            }, 
            "data": "Beautiful color and the fabric is very substantial and soft. but, they didn't finish the bottom hem! the dress is lined and the bottom inside has a ribbon sewn in as a type of hem, but the actual edge is just cut and not turned in on itself. because of this the whole bottom had a hundred little fabric frays. the rest of the dress is so polished it just doesn't make sense. also, while the fabric is beautiful my dress had a weird mark on the chest, almost like a water mark. just overall bad attent", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "negative", 
                "Fit": "neutral"
            }, 
            "data": "I bought this dress to wear to an out of state wedding. first time wearing, when i tied the strap, the pull through at the top of the halter broke with minimal stress. i sewed it back with a repair kit from the hotel but was worried the whole night the dress would not hold up. if this is all that is holding the dress on, it should be more secure with reinforced stitching. beautiful material and comfortable.", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "This sweater is of nice quality and has such great detail to it - love the pattern to the knit and the ribbon detail is unique and beautiful. the knit itself is of mid to thicker weight, so definitely appropriate for winter, fall, and cooler spring days. i bought my normal size small and felt like it had more of a slub fit than pictured in the model shot - it was wider down the torso and a little shorter (not tunic length like picture). i'm 5'7\" with a longer torso and this hit maybe mid-bum and", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "I wanted to love this dress as it would have been perfect for a wedding i have in october however, the fit was awful;. the dress was heavy with a funky liner. it also had these little black straps around the top of the arm/neck that looked out of place. it ran true to size but i have a large chest (32dd) and it was pretty fitted around the area but loose everywhere else. \n \n sadly, dress had to be returned.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "positive", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "I ordered ivory in xl because this brand tends to run tight if you're well endowed. it's a beautiful color and i love the contrasting plaid lining the inside of the collar and cuffs. haven't decided about keeping it because it looks oversized (but cozy) and it's really long. it almost touches the top of my knees in back. sooooo pretty though.", 
            "label": "positive"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "Bought this in an xs and i liked the style of the skirt. it was long enough to wear to work. \n however the waist was too large and would not stay up on my waist. returned.", 
            "label": "neutral"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "negative", 
                "Fabric": "negative", 
                "Fit": "neutral"
            }, 
            "data": "The top is totally see through and fabric some what itchy. it also feels cheap to the touch. i love the idea but can't keep it for this price...i'm a shorty so i'd have to hem it too! sadly will return.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "negative", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "I was really wanting a nice white summer blouse to pair with patterned skirts. unfortunately, this fell short as it was huge. not only was it big, it flared at the bottom. it would be perfect if i was sporting a baby bump, but not what i am going for right now. if the tank was a bit slimmer i would have kept it as a tunic.i'm sad that i'll have to return it.", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "neutral", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "negative"
            }, 
            "data": "This top was a big disappointment. i ordered two of the grey motif with the print of the forest animals in size 16. neither of them fit well, but one was cut much smaller than the other. i've had this problem with all of the numerically-sized buttondown style of maeve tops. i don't understand why in size 14 & 16, this keeps happening. that's why i purchase two of each. usually one fits and the other doesn't. this time, unfortunately, neither worked. they both were too tight in the arms/shoulders", 
            "label": "negative"
        }, 
        {
            "label2": {
                "Color": "neutral", 
                "Style": "positive", 
                "Cost": "neutral", 
                "Fabric": "neutral", 
                "Fit": "positive"
            }, 
            "data": "This tunic is very nic